mod test_structs_layout;

const VL53LX_SOFT_RESET: u32 = 0;
const VL53LX_I2C_SLAVE__DEVICE_ADDRESS: u32 = 1;
const VL53LX_ANA_CONFIG__VHV_REF_SEL_VDDPIX: u32 = 2;
const VL53LX_ANA_CONFIG__VHV_REF_SEL_VQUENCH: u32 = 3;
const VL53LX_ANA_CONFIG__REG_AVDD1V2_SEL: u32 = 4;
const VL53LX_ANA_CONFIG__FAST_OSC__TRIM: u32 = 5;
const VL53LX_OSC_MEASURED__FAST_OSC__FREQUENCY: u32 = 6;
const VL53LX_OSC_MEASURED__FAST_OSC__FREQUENCY_HI: u32 = 6;
const VL53LX_OSC_MEASURED__FAST_OSC__FREQUENCY_LO: u32 = 7;
const VL53LX_VHV_CONFIG__TIMEOUT_MACROP_LOOP_BOUND: u32 = 8;
const VL53LX_VHV_CONFIG__COUNT_THRESH: u32 = 9;
const VL53LX_VHV_CONFIG__OFFSET: u32 = 10;
const VL53LX_VHV_CONFIG__INIT: u32 = 11;
const VL53LX_GLOBAL_CONFIG__SPAD_ENABLES_REF_0: u32 = 13;
const VL53LX_GLOBAL_CONFIG__SPAD_ENABLES_REF_1: u32 = 14;
const VL53LX_GLOBAL_CONFIG__SPAD_ENABLES_REF_2: u32 = 15;
const VL53LX_GLOBAL_CONFIG__SPAD_ENABLES_REF_3: u32 = 16;
const VL53LX_GLOBAL_CONFIG__SPAD_ENABLES_REF_4: u32 = 17;
const VL53LX_GLOBAL_CONFIG__SPAD_ENABLES_REF_5: u32 = 18;
const VL53LX_GLOBAL_CONFIG__REF_EN_START_SELECT: u32 = 19;
const VL53LX_REF_SPAD_MAN__NUM_REQUESTED_REF_SPADS: u32 = 20;
const VL53LX_REF_SPAD_MAN__REF_LOCATION: u32 = 21;
const VL53LX_ALGO__CROSSTALK_COMPENSATION_PLANE_OFFSET_KCPS: u32 = 22;
const VL53LX_ALGO__CROSSTALK_COMPENSATION_PLANE_OFFSET_KCPS_HI: u32 = 22;
const VL53LX_ALGO__CROSSTALK_COMPENSATION_PLANE_OFFSET_KCPS_LO: u32 = 23;

const VL53LX_RANGESTATUS_HARDWARE_FAIL: u32 = 5;
const VL53LX_RANGESTATUS_RANGE_VALID_NO_WRAP_CHECK_FAIL: u32 = 6;
const VL53LX_RANGESTATUS_WRAP_TARGET_FAIL: u32 = 7;
const VL53LX_RANGESTATUS_PROCESSING_FAIL: u32 = 8;
const VL53LX_RANGESTATUS_XTALK_SIGNAL_FAIL: u32 = 9;
const VL53LX_RANGESTATUS_SYNCRONISATION_INT: u32 = 10;
const VL53LX_RANGESTATUS_RANGE_VALID_MERGED_PULSE: u32 = 11;
const VL53LX_RANGESTATUS_TARGET_PRESENT_LACK_OF_SIGNAL: u32 = 12;
const VL53LX_RANGESTATUS_MIN_RANGE_FAIL: u32 = 13;
const VL53LX_RANGESTATUS_RANGE_INVALID: u32 = 14;
const VL53LX_RANGESTATUS_NONE: u32 = 255;
const VL53LX_D_012: u32 = 4;
const INPUT: u32 = 0;
const OUTPUT: u32 = 1;
const LOW: u32 = 0;
const HIGH: u32 = 1;
const VL53LX_HISTOGRAM_CONFIG__OPCODE_SEQUENCE_0: u32 = 54;
const VL53LX_HISTOGRAM_CONFIG__OPCODE_SEQUENCE_1: u32 = 55;
const VL53LX_HISTOGRAM_CONFIG__OPCODE_SEQUENCE_2: u32 = 56;
const VL53LX_HISTOGRAM_CONFIG__AMB_THRESH_HIGH: u32 = 60;
const VL53LX_RESULT__HISTOGRAM_BIN_0_2: u32 = 142;
const VL53LX_RESULT__HISTOGRAM_BIN_0_1: u32 = 143;
const VL53LX_RESULT__HISTOGRAM_BIN_0_0: u32 = 144;
const VL53LX_RESULT__HISTOGRAM_BIN_23_2: u32 = 211;
const VL53LX_RESULT__HISTOGRAM_BIN_23_1: u32 = 212;
const VL53LX_RESULT__HISTOGRAM_BIN_23_0: u32 = 213;
const VL53LX_RESULT__HISTOGRAM_BIN_23_0_MSB: u32 = 217;
const VL53LX_RESULT__HISTOGRAM_BIN_23_0_LSB: u32 = 218;
const VL53LX_HISTOGRAM_BIN_DATA_I2C_INDEX: u32 = 136;
const VL53LX_HISTOGRAM_BIN_DATA_I2C_SIZE_BYTES: u32 = 83;
const VL53LX_DEFAULT_DEVICE_ADDRESS: u32 = 82;
const VL53LX_MAX_I2C_XFER_SIZE: u32 = 256;
const CONT_CONTINUE: u32 = 0;
const CONT_NEXT_LOOP: u32 = 1;
const CONT_RESET: u32 = 2;
const DMAX_REFLECTANCE_IDX: u32 = 2;
const LOWPOWER_AUTO_VHV_LOOP_DURATION_US: u32 = 245;
const LOWPOWER_AUTO_OVERHEAD_BEFORE_A_RANGING: u32 = 1448;
const LOWPOWER_AUTO_OVERHEAD_BETWEEN_A_B_RANGING: u32 = 2100;
const FDA_MAX_TIMING_BUDGET_US: u32 = 550000;
const VL53LX_NVM_POWER_UP_DELAY_US: u32 = 50;
const VL53LX_NVM_READ_TRIGGER_DELAY_US: u32 = 5;
const VL53LX_D_002: u32 = 65535;
const VL53LX_D_008: u32 = 65535;
const VL53LX_D_003: u32 = 16777215;
const VL53LX_D_007: u32 = 4294967295;
const VL53LX_D_005: u64 = 549755813887;
const VL53LX_D_009: u64 = 1099511627775;
const VL53LX_D_010: u64 = 281474976710655;
const VL53LX_D_004: u64 = 72057594037927935;
const VL53LX_D_006: u64 = 9223372036854775807;
const VL53LX_D_011: i32 = -1;

type std_size_t = ::std::os::raw::c_ulong;
type std_nullptr_t = *const ::std::os::raw::c_void;
type size_t = ::std::os::raw::c_ulong;
type _Float32 = f32;
type _Float64 = f64;
type _Float32x = f64;
type _Float64x = u128;

#[repr(C)]
struct ComponentObject__bindgen_vtable(::std::os::raw::c_void);
#[doc = " An abstract class for Generic components."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct ComponentObject {
    vtable_: *const ComponentObject__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_ComponentObject() {
    assert_eq!(
        ::std::mem::size_of::<ComponentObject>(),
        8usize,
        concat!("Size of: ", stringify!(ComponentObject))
    );
    assert_eq!(
        ::std::mem::align_of::<ComponentObject>(),
        8usize,
        concat!("Alignment of ", stringify!(ComponentObject))
    );
}
#[doc = " An abstract class for range sensors"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct RangeSensor {
    _base: ComponentObject,
}
#[test]
fn bindgen_test_layout_RangeSensor() {
    assert_eq!(
        ::std::mem::size_of::<RangeSensor>(),
        8usize,
        concat!("Size of: ", stringify!(RangeSensor))
    );
    assert_eq!(
        ::std::mem::align_of::<RangeSensor>(),
        8usize,
        concat!("Alignment of ", stringify!(RangeSensor))
    );
}
const VL53LX_Tuning_t_VL53LX_TUNING_VERSION: VL53LX_Tuning_t = 0;
const VL53LX_Tuning_t_VL53LX_TUNING_PROXY_MIN: VL53LX_Tuning_t = 1;
const VL53LX_Tuning_t_VL53LX_TUNING_SINGLE_TARGET_XTALK_TARGET_DISTANCE_MM: VL53LX_Tuning_t = 2;
const VL53LX_Tuning_t_VL53LX_TUNING_SINGLE_TARGET_XTALK_SAMPLE_NUMBER: VL53LX_Tuning_t = 3;
const VL53LX_Tuning_t_VL53LX_TUNING_MIN_AMBIENT_DMAX_VALID: VL53LX_Tuning_t = 4;
const VL53LX_Tuning_t_VL53LX_TUNING_MAX_SIMPLE_OFFSET_CALIBRATION_SAMPLE_NUMBER:
    VL53LX_Tuning_t = 5;
const VL53LX_Tuning_t_VL53LX_TUNING_XTALK_FULL_ROI_TARGET_DISTANCE_MM: VL53LX_Tuning_t = 6;
const VL53LX_Tuning_t_VL53LX_TUNING_SIMPLE_OFFSET_CALIBRATION_REPEAT: VL53LX_Tuning_t = 7;
const VL53LX_Tuning_t_VL53LX_TUNING_XTALK_FULL_ROI_BIN_SUM_MARGIN: VL53LX_Tuning_t = 8;
const VL53LX_Tuning_t_VL53LX_TUNING_XTALK_FULL_ROI_DEFAULT_OFFSET: VL53LX_Tuning_t = 9;
const VL53LX_Tuning_t_VL53LX_TUNING_ZERO_DISTANCE_OFFSET_NON_LINEAR_FACTOR: VL53LX_Tuning_t =
    10;
const VL53LX_Tuning_t_VL53LX_TUNING_MAX_TUNABLE_KEY: VL53LX_Tuning_t = 11;
type VL53LX_Tuning_t = ::std::os::raw::c_uint;
type FixPoint1616_t = u32;
type VL53LX_Error = i8;
#[doc = " @} VL53LX_define_Error_group"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct VL53LX_hist_gen3_dmax_private_data_t {
    VL53LX_p_037: u32,
    VL53LX_p_063: u8,
    VL53LX_p_064: u8,
    VL53LX_p_065: u16,
    VL53LX_p_066: u16,
    VL53LX_p_067: u16,
    VL53LX_p_038: u16,
    VL53LX_p_009: u32,
    VL53LX_p_033: u32,
    VL53LX_p_034: u16,
    VL53LX_p_004: u16,
    VL53LX_p_028: u32,
    VL53LX_p_035: u32,
    VL53LX_p_036: i16,
    VL53LX_p_022: i16,
}
#[test]
fn bindgen_test_layout_VL53LX_hist_gen3_dmax_private_data_t() {
    assert_eq!(
        ::std::mem::size_of::<VL53LX_hist_gen3_dmax_private_data_t>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(VL53LX_hist_gen3_dmax_private_data_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<VL53LX_hist_gen3_dmax_private_data_t>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(VL53LX_hist_gen3_dmax_private_data_t)
        )
    );
    fn test_field_VL53LX_p_037() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_hist_gen3_dmax_private_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).VL53LX_p_037) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(VL53LX_p_037)
            )
        );
    }
    test_field_VL53LX_p_037();
    fn test_field_VL53LX_p_063() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_hist_gen3_dmax_private_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).VL53LX_p_063) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(VL53LX_p_063)
            )
        );
    }
    test_field_VL53LX_p_063();
    fn test_field_VL53LX_p_064() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_hist_gen3_dmax_private_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).VL53LX_p_064) as usize - ptr as usize
            },
            5usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(VL53LX_p_064)
            )
        );
    }
    test_field_VL53LX_p_064();
    fn test_field_VL53LX_p_065() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_hist_gen3_dmax_private_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).VL53LX_p_065) as usize - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(VL53LX_p_065)
            )
        );
    }
    test_field_VL53LX_p_065();
    fn test_field_VL53LX_p_066() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_hist_gen3_dmax_private_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).VL53LX_p_066) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(VL53LX_p_066)
            )
        );
    }
    test_field_VL53LX_p_066();
    fn test_field_VL53LX_p_067() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_hist_gen3_dmax_private_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).VL53LX_p_067) as usize - ptr as usize
            },
            10usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(VL53LX_p_067)
            )
        );
    }
    test_field_VL53LX_p_067();
    fn test_field_VL53LX_p_038() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_hist_gen3_dmax_private_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).VL53LX_p_038) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(VL53LX_p_038)
            )
        );
    }
    test_field_VL53LX_p_038();
    fn test_field_VL53LX_p_009() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_hist_gen3_dmax_private_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).VL53LX_p_009) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(VL53LX_p_009)
            )
        );
    }
    test_field_VL53LX_p_009();
    fn test_field_VL53LX_p_033() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_hist_gen3_dmax_private_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).VL53LX_p_033) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(VL53LX_p_033)
            )
        );
    }
    test_field_VL53LX_p_033();
    fn test_field_VL53LX_p_034() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_hist_gen3_dmax_private_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).VL53LX_p_034) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(VL53LX_p_034)
            )
        );
    }
    test_field_VL53LX_p_034();
    fn test_field_VL53LX_p_004() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_hist_gen3_dmax_private_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).VL53LX_p_004) as usize - ptr as usize
            },
            26usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(VL53LX_p_004)
            )
        );
    }
    test_field_VL53LX_p_004();
    fn test_field_VL53LX_p_028() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_hist_gen3_dmax_private_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).VL53LX_p_028) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(VL53LX_p_028)
            )
        );
    }
    test_field_VL53LX_p_028();
    fn test_field_VL53LX_p_035() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_hist_gen3_dmax_private_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).VL53LX_p_035) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(VL53LX_p_035)
            )
        );
    }
    test_field_VL53LX_p_035();
    fn test_field_VL53LX_p_036() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_hist_gen3_dmax_private_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).VL53LX_p_036) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(VL53LX_p_036)
            )
        );
    }
    test_field_VL53LX_p_036();
    fn test_field_VL53LX_p_022() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_hist_gen3_dmax_private_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).VL53LX_p_022) as usize - ptr as usize
            },
            38usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(VL53LX_p_022)
            )
        );
    }
    test_field_VL53LX_p_022();
}
type VL53LX_WaitMethod = u8;
type VL53LX_DeviceState = u8;
type VL53LX_DeviceZonePreset = u8;
type VL53LX_DevicePresetModes = u8;
type VL53LX_DeviceMeasurementModes = u8;
type VL53LX_OffsetCalibrationMode = u8;
type VL53LX_OffsetCorrectionMode = u8;
type VL53LX_DeviceDmaxMode = u8;
type VL53LX_DeviceSequenceConfig = u8;
type VL53LX_DeviceInterruptPolarity = u8;
type VL53LX_DeviceGpioMode = u8;
type VL53LX_DeviceError = u8;
type VL53LX_DeviceReportStatus = u8;
type VL53LX_DeviceDssMode = u8;
type VL53LX_HistAlgoSelect = u8;
type VL53LX_HistTargetOrder = u8;
type VL53LX_HistAmbEstMethod = u8;
type VL53LX_HistXtalkCompEnable = u8;
type VL53LX_DeviceConfigLevel = u8;
type VL53LX_DeviceResultsLevel = u8;
type VL53LX_DeviceTestMode = u8;
type VL53LX_DeviceSscArray = u8;
type VL53LX_ZoneConfig_BinConfig_select = u8;
type VL53LX_GPIO_Interrupt_Mode = u8;
type VL53LX_TuningParms = u16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct VL53LX_static_nvm_managed_t {
    i2c_slave__device_address: u8,
    ana_config__vhv_ref_sel_vddpix: u8,
    ana_config__vhv_ref_sel_vquench: u8,
    ana_config__reg_avdd1v2_sel: u8,
    ana_config__fast_osc__trim: u8,
    osc_measured__fast_osc__frequency: u16,
    vhv_config__timeout_macrop_loop_bound: u8,
    vhv_config__count_thresh: u8,
    vhv_config__offset: u8,
    vhv_config__init: u8,
}
#[test]
fn bindgen_test_layout_VL53LX_static_nvm_managed_t() {
    assert_eq!(
        ::std::mem::size_of::<VL53LX_static_nvm_managed_t>(),
        12usize,
        concat!("Size of: ", stringify!(VL53LX_static_nvm_managed_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VL53LX_static_nvm_managed_t>(),
        2usize,
        concat!("Alignment of ", stringify!(VL53LX_static_nvm_managed_t))
    );
    fn test_field_i2c_slave__device_address() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).i2c_slave__device_address) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_nvm_managed_t),
                "::",
                stringify!(i2c_slave__device_address)
            )
        );
    }
    test_field_i2c_slave__device_address();
    fn test_field_ana_config__vhv_ref_sel_vddpix() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ana_config__vhv_ref_sel_vddpix) as usize - ptr as usize
            },
            1usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_nvm_managed_t),
                "::",
                stringify!(ana_config__vhv_ref_sel_vddpix)
            )
        );
    }
    test_field_ana_config__vhv_ref_sel_vddpix();
    fn test_field_ana_config__vhv_ref_sel_vquench() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ana_config__vhv_ref_sel_vquench) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_nvm_managed_t),
                "::",
                stringify!(ana_config__vhv_ref_sel_vquench)
            )
        );
    }
    test_field_ana_config__vhv_ref_sel_vquench();
    fn test_field_ana_config__reg_avdd1v2_sel() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ana_config__reg_avdd1v2_sel) as usize - ptr as usize
            },
            3usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_nvm_managed_t),
                "::",
                stringify!(ana_config__reg_avdd1v2_sel)
            )
        );
    }
    test_field_ana_config__reg_avdd1v2_sel();
    fn test_field_ana_config__fast_osc__trim() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ana_config__fast_osc__trim) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_nvm_managed_t),
                "::",
                stringify!(ana_config__fast_osc__trim)
            )
        );
    }
    test_field_ana_config__fast_osc__trim();
    fn test_field_osc_measured__fast_osc__frequency() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).osc_measured__fast_osc__frequency) as usize
                    - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_nvm_managed_t),
                "::",
                stringify!(osc_measured__fast_osc__frequency)
            )
        );
    }
    test_field_osc_measured__fast_osc__frequency();
    fn test_field_vhv_config__timeout_macrop_loop_bound() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vhv_config__timeout_macrop_loop_bound) as usize
                    - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_nvm_managed_t),
                "::",
                stringify!(vhv_config__timeout_macrop_loop_bound)
            )
        );
    }
    test_field_vhv_config__timeout_macrop_loop_bound();
    fn test_field_vhv_config__count_thresh() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vhv_config__count_thresh) as usize - ptr as usize
            },
            9usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_nvm_managed_t),
                "::",
                stringify!(vhv_config__count_thresh)
            )
        );
    }
    test_field_vhv_config__count_thresh();
    fn test_field_vhv_config__offset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vhv_config__offset) as usize - ptr as usize
            },
            10usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_nvm_managed_t),
                "::",
                stringify!(vhv_config__offset)
            )
        );
    }
    test_field_vhv_config__offset();
    fn test_field_vhv_config__init() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vhv_config__init) as usize - ptr as usize
            },
            11usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_nvm_managed_t),
                "::",
                stringify!(vhv_config__init)
            )
        );
    }
    test_field_vhv_config__init();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct VL53LX_customer_nvm_managed_t {
    global_config__spad_enables_ref_0: u8,
    global_config__spad_enables_ref_1: u8,
    global_config__spad_enables_ref_2: u8,
    global_config__spad_enables_ref_3: u8,
    global_config__spad_enables_ref_4: u8,
    global_config__spad_enables_ref_5: u8,
    global_config__ref_en_start_select: u8,
    ref_spad_man__num_requested_ref_spads: u8,
    ref_spad_man__ref_location: u8,
    algo__crosstalk_compensation_plane_offset_kcps: u16,
    algo__crosstalk_compensation_x_plane_gradient_kcps: i16,
    algo__crosstalk_compensation_y_plane_gradient_kcps: i16,
    ref_spad_char__total_rate_target_mcps: u16,
    algo__part_to_part_range_offset_mm: i16,
    mm_config__inner_offset_mm: i16,
    mm_config__outer_offset_mm: i16,
}
#[test]
fn bindgen_test_layout_VL53LX_customer_nvm_managed_t() {
    assert_eq!(
        ::std::mem::size_of::<VL53LX_customer_nvm_managed_t>(),
        24usize,
        concat!("Size of: ", stringify!(VL53LX_customer_nvm_managed_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VL53LX_customer_nvm_managed_t>(),
        2usize,
        concat!("Alignment of ", stringify!(VL53LX_customer_nvm_managed_t))
    );
    fn test_field_global_config__spad_enables_ref_0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_customer_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_ref_0) as usize
                    - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_customer_nvm_managed_t),
                "::",
                stringify!(global_config__spad_enables_ref_0)
            )
        );
    }
    test_field_global_config__spad_enables_ref_0();
    fn test_field_global_config__spad_enables_ref_1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_customer_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_ref_1) as usize
                    - ptr as usize
            },
            1usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_customer_nvm_managed_t),
                "::",
                stringify!(global_config__spad_enables_ref_1)
            )
        );
    }
    test_field_global_config__spad_enables_ref_1();
    fn test_field_global_config__spad_enables_ref_2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_customer_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_ref_2) as usize
                    - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_customer_nvm_managed_t),
                "::",
                stringify!(global_config__spad_enables_ref_2)
            )
        );
    }
    test_field_global_config__spad_enables_ref_2();
    fn test_field_global_config__spad_enables_ref_3() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_customer_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_ref_3) as usize
                    - ptr as usize
            },
            3usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_customer_nvm_managed_t),
                "::",
                stringify!(global_config__spad_enables_ref_3)
            )
        );
    }
    test_field_global_config__spad_enables_ref_3();
    fn test_field_global_config__spad_enables_ref_4() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_customer_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_ref_4) as usize
                    - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_customer_nvm_managed_t),
                "::",
                stringify!(global_config__spad_enables_ref_4)
            )
        );
    }
    test_field_global_config__spad_enables_ref_4();
    fn test_field_global_config__spad_enables_ref_5() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_customer_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_ref_5) as usize
                    - ptr as usize
            },
            5usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_customer_nvm_managed_t),
                "::",
                stringify!(global_config__spad_enables_ref_5)
            )
        );
    }
    test_field_global_config__spad_enables_ref_5();
    fn test_field_global_config__ref_en_start_select() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_customer_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__ref_en_start_select) as usize
                    - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_customer_nvm_managed_t),
                "::",
                stringify!(global_config__ref_en_start_select)
            )
        );
    }
    test_field_global_config__ref_en_start_select();
    fn test_field_ref_spad_man__num_requested_ref_spads() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_customer_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ref_spad_man__num_requested_ref_spads) as usize
                    - ptr as usize
            },
            7usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_customer_nvm_managed_t),
                "::",
                stringify!(ref_spad_man__num_requested_ref_spads)
            )
        );
    }
    test_field_ref_spad_man__num_requested_ref_spads();
    fn test_field_ref_spad_man__ref_location() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_customer_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ref_spad_man__ref_location) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_customer_nvm_managed_t),
                "::",
                stringify!(ref_spad_man__ref_location)
            )
        );
    }
    test_field_ref_spad_man__ref_location();
    fn test_field_algo__crosstalk_compensation_plane_offset_kcps() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_customer_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).algo__crosstalk_compensation_plane_offset_kcps) as usize
                    - ptr as usize
            },
            10usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_customer_nvm_managed_t),
                "::",
                stringify!(algo__crosstalk_compensation_plane_offset_kcps)
            )
        );
    }
    test_field_algo__crosstalk_compensation_plane_offset_kcps();
    fn test_field_algo__crosstalk_compensation_x_plane_gradient_kcps() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_customer_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).algo__crosstalk_compensation_x_plane_gradient_kcps)
                    as usize
                    - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_customer_nvm_managed_t),
                "::",
                stringify!(algo__crosstalk_compensation_x_plane_gradient_kcps)
            )
        );
    }
    test_field_algo__crosstalk_compensation_x_plane_gradient_kcps();
    fn test_field_algo__crosstalk_compensation_y_plane_gradient_kcps() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_customer_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).algo__crosstalk_compensation_y_plane_gradient_kcps)
                    as usize
                    - ptr as usize
            },
            14usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_customer_nvm_managed_t),
                "::",
                stringify!(algo__crosstalk_compensation_y_plane_gradient_kcps)
            )
        );
    }
    test_field_algo__crosstalk_compensation_y_plane_gradient_kcps();
    fn test_field_ref_spad_char__total_rate_target_mcps() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_customer_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ref_spad_char__total_rate_target_mcps) as usize
                    - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_customer_nvm_managed_t),
                "::",
                stringify!(ref_spad_char__total_rate_target_mcps)
            )
        );
    }
    test_field_ref_spad_char__total_rate_target_mcps();
    fn test_field_algo__part_to_part_range_offset_mm() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_customer_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).algo__part_to_part_range_offset_mm) as usize
                    - ptr as usize
            },
            18usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_customer_nvm_managed_t),
                "::",
                stringify!(algo__part_to_part_range_offset_mm)
            )
        );
    }
    test_field_algo__part_to_part_range_offset_mm();
    fn test_field_mm_config__inner_offset_mm() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_customer_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mm_config__inner_offset_mm) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_customer_nvm_managed_t),
                "::",
                stringify!(mm_config__inner_offset_mm)
            )
        );
    }
    test_field_mm_config__inner_offset_mm();
    fn test_field_mm_config__outer_offset_mm() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_customer_nvm_managed_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mm_config__outer_offset_mm) as usize - ptr as usize
            },
            22usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_customer_nvm_managed_t),
                "::",
                stringify!(mm_config__outer_offset_mm)
            )
        );
    }
    test_field_mm_config__outer_offset_mm();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct VL53LX_static_config_t {
    dss_config__target_total_rate_mcps: u16,
    debug__ctrl: u8,
    test_mode__ctrl: u8,
    clk_gating__ctrl: u8,
    nvm_bist__ctrl: u8,
    nvm_bist__num_nvm_words: u8,
    nvm_bist__start_address: u8,
    host_if__status: u8,
    pad_i2c_hv__config: u8,
    pad_i2c_hv__extsup_config: u8,
    gpio_hv_pad__ctrl: u8,
    gpio_hv_mux__ctrl: u8,
    gpio__tio_hv_status: u8,
    gpio__fio_hv_status: u8,
    ana_config__spad_sel_pswidth: u8,
    ana_config__vcsel_pulse_width_offset: u8,
    ana_config__fast_osc__config_ctrl: u8,
    sigma_estimator__effective_pulse_width_ns: u8,
    sigma_estimator__effective_ambient_width_ns: u8,
    sigma_estimator__sigma_ref_mm: u8,
    algo__crosstalk_compensation_valid_height_mm: u8,
    spare_host_config__static_config_spare_0: u8,
    spare_host_config__static_config_spare_1: u8,
    algo__range_ignore_threshold_mcps: u16,
    algo__range_ignore_valid_height_mm: u8,
    algo__range_min_clip: u8,
    algo__consistency_check__tolerance: u8,
    spare_host_config__static_config_spare_2: u8,
    sd_config__reset_stages_msb: u8,
    sd_config__reset_stages_lsb: u8,
}
#[test]
fn bindgen_test_layout_VL53LX_static_config_t() {
    assert_eq!(
        ::std::mem::size_of::<VL53LX_static_config_t>(),
        32usize,
        concat!("Size of: ", stringify!(VL53LX_static_config_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VL53LX_static_config_t>(),
        2usize,
        concat!("Alignment of ", stringify!(VL53LX_static_config_t))
    );
    fn test_field_dss_config__target_total_rate_mcps() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_config__target_total_rate_mcps) as usize
                    - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(dss_config__target_total_rate_mcps)
            )
        );
    }
    test_field_dss_config__target_total_rate_mcps();
    fn test_field_debug__ctrl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).debug__ctrl) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(debug__ctrl)
            )
        );
    }
    test_field_debug__ctrl();
    fn test_field_test_mode__ctrl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).test_mode__ctrl) as usize - ptr as usize
            },
            3usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(test_mode__ctrl)
            )
        );
    }
    test_field_test_mode__ctrl();
    fn test_field_clk_gating__ctrl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).clk_gating__ctrl) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(clk_gating__ctrl)
            )
        );
    }
    test_field_clk_gating__ctrl();
    fn test_field_nvm_bist__ctrl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nvm_bist__ctrl) as usize - ptr as usize
            },
            5usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(nvm_bist__ctrl)
            )
        );
    }
    test_field_nvm_bist__ctrl();
    fn test_field_nvm_bist__num_nvm_words() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nvm_bist__num_nvm_words) as usize - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(nvm_bist__num_nvm_words)
            )
        );
    }
    test_field_nvm_bist__num_nvm_words();
    fn test_field_nvm_bist__start_address() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nvm_bist__start_address) as usize - ptr as usize
            },
            7usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(nvm_bist__start_address)
            )
        );
    }
    test_field_nvm_bist__start_address();
    fn test_field_host_if__status() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).host_if__status) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(host_if__status)
            )
        );
    }
    test_field_host_if__status();
    fn test_field_pad_i2c_hv__config() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pad_i2c_hv__config) as usize - ptr as usize
            },
            9usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(pad_i2c_hv__config)
            )
        );
    }
    test_field_pad_i2c_hv__config();
    fn test_field_pad_i2c_hv__extsup_config() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pad_i2c_hv__extsup_config) as usize - ptr as usize
            },
            10usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(pad_i2c_hv__extsup_config)
            )
        );
    }
    test_field_pad_i2c_hv__extsup_config();
    fn test_field_gpio_hv_pad__ctrl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gpio_hv_pad__ctrl) as usize - ptr as usize
            },
            11usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(gpio_hv_pad__ctrl)
            )
        );
    }
    test_field_gpio_hv_pad__ctrl();
    fn test_field_gpio_hv_mux__ctrl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gpio_hv_mux__ctrl) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(gpio_hv_mux__ctrl)
            )
        );
    }
    test_field_gpio_hv_mux__ctrl();
    fn test_field_gpio__tio_hv_status() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gpio__tio_hv_status) as usize - ptr as usize
            },
            13usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(gpio__tio_hv_status)
            )
        );
    }
    test_field_gpio__tio_hv_status();
    fn test_field_gpio__fio_hv_status() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gpio__fio_hv_status) as usize - ptr as usize
            },
            14usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(gpio__fio_hv_status)
            )
        );
    }
    test_field_gpio__fio_hv_status();
    fn test_field_ana_config__spad_sel_pswidth() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ana_config__spad_sel_pswidth) as usize - ptr as usize
            },
            15usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(ana_config__spad_sel_pswidth)
            )
        );
    }
    test_field_ana_config__spad_sel_pswidth();
    fn test_field_ana_config__vcsel_pulse_width_offset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ana_config__vcsel_pulse_width_offset) as usize
                    - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(ana_config__vcsel_pulse_width_offset)
            )
        );
    }
    test_field_ana_config__vcsel_pulse_width_offset();
    fn test_field_ana_config__fast_osc__config_ctrl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ana_config__fast_osc__config_ctrl) as usize
                    - ptr as usize
            },
            17usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(ana_config__fast_osc__config_ctrl)
            )
        );
    }
    test_field_ana_config__fast_osc__config_ctrl();
    fn test_field_sigma_estimator__effective_pulse_width_ns() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sigma_estimator__effective_pulse_width_ns) as usize
                    - ptr as usize
            },
            18usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(sigma_estimator__effective_pulse_width_ns)
            )
        );
    }
    test_field_sigma_estimator__effective_pulse_width_ns();
    fn test_field_sigma_estimator__effective_ambient_width_ns() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sigma_estimator__effective_ambient_width_ns) as usize
                    - ptr as usize
            },
            19usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(sigma_estimator__effective_ambient_width_ns)
            )
        );
    }
    test_field_sigma_estimator__effective_ambient_width_ns();
    fn test_field_sigma_estimator__sigma_ref_mm() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sigma_estimator__sigma_ref_mm) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(sigma_estimator__sigma_ref_mm)
            )
        );
    }
    test_field_sigma_estimator__sigma_ref_mm();
    fn test_field_algo__crosstalk_compensation_valid_height_mm() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).algo__crosstalk_compensation_valid_height_mm) as usize
                    - ptr as usize
            },
            21usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(algo__crosstalk_compensation_valid_height_mm)
            )
        );
    }
    test_field_algo__crosstalk_compensation_valid_height_mm();
    fn test_field_spare_host_config__static_config_spare_0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).spare_host_config__static_config_spare_0) as usize
                    - ptr as usize
            },
            22usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(spare_host_config__static_config_spare_0)
            )
        );
    }
    test_field_spare_host_config__static_config_spare_0();
    fn test_field_spare_host_config__static_config_spare_1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).spare_host_config__static_config_spare_1) as usize
                    - ptr as usize
            },
            23usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(spare_host_config__static_config_spare_1)
            )
        );
    }
    test_field_spare_host_config__static_config_spare_1();
    fn test_field_algo__range_ignore_threshold_mcps() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).algo__range_ignore_threshold_mcps) as usize
                    - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(algo__range_ignore_threshold_mcps)
            )
        );
    }
    test_field_algo__range_ignore_threshold_mcps();
    fn test_field_algo__range_ignore_valid_height_mm() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).algo__range_ignore_valid_height_mm) as usize
                    - ptr as usize
            },
            26usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(algo__range_ignore_valid_height_mm)
            )
        );
    }
    test_field_algo__range_ignore_valid_height_mm();
    fn test_field_algo__range_min_clip() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).algo__range_min_clip) as usize - ptr as usize
            },
            27usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(algo__range_min_clip)
            )
        );
    }
    test_field_algo__range_min_clip();
    fn test_field_algo__consistency_check__tolerance() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).algo__consistency_check__tolerance) as usize
                    - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(algo__consistency_check__tolerance)
            )
        );
    }
    test_field_algo__consistency_check__tolerance();
    fn test_field_spare_host_config__static_config_spare_2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).spare_host_config__static_config_spare_2) as usize
                    - ptr as usize
            },
            29usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(spare_host_config__static_config_spare_2)
            )
        );
    }
    test_field_spare_host_config__static_config_spare_2();
    fn test_field_sd_config__reset_stages_msb() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sd_config__reset_stages_msb) as usize - ptr as usize
            },
            30usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(sd_config__reset_stages_msb)
            )
        );
    }
    test_field_sd_config__reset_stages_msb();
    fn test_field_sd_config__reset_stages_lsb() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sd_config__reset_stages_lsb) as usize - ptr as usize
            },
            31usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_static_config_t),
                "::",
                stringify!(sd_config__reset_stages_lsb)
            )
        );
    }
    test_field_sd_config__reset_stages_lsb();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct VL53LX_general_config_t {
    gph_config__stream_count_update_value: u8,
    global_config__stream_divider: u8,
    system__interrupt_config_gpio: u8,
    cal_config__vcsel_start: u8,
    cal_config__repeat_rate: u16,
    global_config__vcsel_width: u8,
    phasecal_config__timeout_macrop: u8,
    phasecal_config__target: u8,
    phasecal_config__override: u8,
    dss_config__roi_mode_control: u8,
    system__thresh_rate_high: u16,
    system__thresh_rate_low: u16,
    dss_config__manual_effective_spads_select: u16,
    dss_config__manual_block_select: u8,
    dss_config__aperture_attenuation: u8,
    dss_config__max_spads_limit: u8,
    dss_config__min_spads_limit: u8,
}
#[test]
fn bindgen_test_layout_VL53LX_general_config_t() {
    assert_eq!(
        ::std::mem::size_of::<VL53LX_general_config_t>(),
        22usize,
        concat!("Size of: ", stringify!(VL53LX_general_config_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VL53LX_general_config_t>(),
        2usize,
        concat!("Alignment of ", stringify!(VL53LX_general_config_t))
    );
    fn test_field_gph_config__stream_count_update_value() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_general_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph_config__stream_count_update_value) as usize
                    - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_general_config_t),
                "::",
                stringify!(gph_config__stream_count_update_value)
            )
        );
    }
    test_field_gph_config__stream_count_update_value();
    fn test_field_global_config__stream_divider() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_general_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__stream_divider) as usize - ptr as usize
            },
            1usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_general_config_t),
                "::",
                stringify!(global_config__stream_divider)
            )
        );
    }
    test_field_global_config__stream_divider();
    fn test_field_system__interrupt_config_gpio() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_general_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).system__interrupt_config_gpio) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_general_config_t),
                "::",
                stringify!(system__interrupt_config_gpio)
            )
        );
    }
    test_field_system__interrupt_config_gpio();
    fn test_field_cal_config__vcsel_start() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_general_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cal_config__vcsel_start) as usize - ptr as usize
            },
            3usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_general_config_t),
                "::",
                stringify!(cal_config__vcsel_start)
            )
        );
    }
    test_field_cal_config__vcsel_start();
    fn test_field_cal_config__repeat_rate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_general_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cal_config__repeat_rate) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_general_config_t),
                "::",
                stringify!(cal_config__repeat_rate)
            )
        );
    }
    test_field_cal_config__repeat_rate();
    fn test_field_global_config__vcsel_width() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_general_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__vcsel_width) as usize - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_general_config_t),
                "::",
                stringify!(global_config__vcsel_width)
            )
        );
    }
    test_field_global_config__vcsel_width();
    fn test_field_phasecal_config__timeout_macrop() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_general_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).phasecal_config__timeout_macrop) as usize - ptr as usize
            },
            7usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_general_config_t),
                "::",
                stringify!(phasecal_config__timeout_macrop)
            )
        );
    }
    test_field_phasecal_config__timeout_macrop();
    fn test_field_phasecal_config__target() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_general_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).phasecal_config__target) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_general_config_t),
                "::",
                stringify!(phasecal_config__target)
            )
        );
    }
    test_field_phasecal_config__target();
    fn test_field_phasecal_config__override() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_general_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).phasecal_config__override) as usize - ptr as usize
            },
            9usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_general_config_t),
                "::",
                stringify!(phasecal_config__override)
            )
        );
    }
    test_field_phasecal_config__override();
    fn test_field_dss_config__roi_mode_control() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_general_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_config__roi_mode_control) as usize - ptr as usize
            },
            10usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_general_config_t),
                "::",
                stringify!(dss_config__roi_mode_control)
            )
        );
    }
    test_field_dss_config__roi_mode_control();
    fn test_field_system__thresh_rate_high() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_general_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).system__thresh_rate_high) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_general_config_t),
                "::",
                stringify!(system__thresh_rate_high)
            )
        );
    }
    test_field_system__thresh_rate_high();
    fn test_field_system__thresh_rate_low() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_general_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).system__thresh_rate_low) as usize - ptr as usize
            },
            14usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_general_config_t),
                "::",
                stringify!(system__thresh_rate_low)
            )
        );
    }
    test_field_system__thresh_rate_low();
    fn test_field_dss_config__manual_effective_spads_select() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_general_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_config__manual_effective_spads_select) as usize
                    - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_general_config_t),
                "::",
                stringify!(dss_config__manual_effective_spads_select)
            )
        );
    }
    test_field_dss_config__manual_effective_spads_select();
    fn test_field_dss_config__manual_block_select() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_general_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_config__manual_block_select) as usize - ptr as usize
            },
            18usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_general_config_t),
                "::",
                stringify!(dss_config__manual_block_select)
            )
        );
    }
    test_field_dss_config__manual_block_select();
    fn test_field_dss_config__aperture_attenuation() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_general_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_config__aperture_attenuation) as usize
                    - ptr as usize
            },
            19usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_general_config_t),
                "::",
                stringify!(dss_config__aperture_attenuation)
            )
        );
    }
    test_field_dss_config__aperture_attenuation();
    fn test_field_dss_config__max_spads_limit() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_general_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_config__max_spads_limit) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_general_config_t),
                "::",
                stringify!(dss_config__max_spads_limit)
            )
        );
    }
    test_field_dss_config__max_spads_limit();
    fn test_field_dss_config__min_spads_limit() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_general_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_config__min_spads_limit) as usize - ptr as usize
            },
            21usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_general_config_t),
                "::",
                stringify!(dss_config__min_spads_limit)
            )
        );
    }
    test_field_dss_config__min_spads_limit();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct VL53LX_timing_config_t {
    mm_config__timeout_macrop_a_hi: u8,
    mm_config__timeout_macrop_a_lo: u8,
    mm_config__timeout_macrop_b_hi: u8,
    mm_config__timeout_macrop_b_lo: u8,
    range_config__timeout_macrop_a_hi: u8,
    range_config__timeout_macrop_a_lo: u8,
    range_config__vcsel_period_a: u8,
    range_config__timeout_macrop_b_hi: u8,
    range_config__timeout_macrop_b_lo: u8,
    range_config__vcsel_period_b: u8,
    range_config__sigma_thresh: u16,
    range_config__min_count_rate_rtn_limit_mcps: u16,
    range_config__valid_phase_low: u8,
    range_config__valid_phase_high: u8,
    system__intermeasurement_period: u32,
    system__fractional_enable: u8,
}
#[test]
fn bindgen_test_layout_VL53LX_timing_config_t() {
    assert_eq!(
        ::std::mem::size_of::<VL53LX_timing_config_t>(),
        24usize,
        concat!("Size of: ", stringify!(VL53LX_timing_config_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VL53LX_timing_config_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VL53LX_timing_config_t))
    );
    fn test_field_mm_config__timeout_macrop_a_hi() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mm_config__timeout_macrop_a_hi) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_timing_config_t),
                "::",
                stringify!(mm_config__timeout_macrop_a_hi)
            )
        );
    }
    test_field_mm_config__timeout_macrop_a_hi();
    fn test_field_mm_config__timeout_macrop_a_lo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mm_config__timeout_macrop_a_lo) as usize - ptr as usize
            },
            1usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_timing_config_t),
                "::",
                stringify!(mm_config__timeout_macrop_a_lo)
            )
        );
    }
    test_field_mm_config__timeout_macrop_a_lo();
    fn test_field_mm_config__timeout_macrop_b_hi() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mm_config__timeout_macrop_b_hi) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_timing_config_t),
                "::",
                stringify!(mm_config__timeout_macrop_b_hi)
            )
        );
    }
    test_field_mm_config__timeout_macrop_b_hi();
    fn test_field_mm_config__timeout_macrop_b_lo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mm_config__timeout_macrop_b_lo) as usize - ptr as usize
            },
            3usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_timing_config_t),
                "::",
                stringify!(mm_config__timeout_macrop_b_lo)
            )
        );
    }
    test_field_mm_config__timeout_macrop_b_lo();
    fn test_field_range_config__timeout_macrop_a_hi() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).range_config__timeout_macrop_a_hi) as usize
                    - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_timing_config_t),
                "::",
                stringify!(range_config__timeout_macrop_a_hi)
            )
        );
    }
    test_field_range_config__timeout_macrop_a_hi();
    fn test_field_range_config__timeout_macrop_a_lo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).range_config__timeout_macrop_a_lo) as usize
                    - ptr as usize
            },
            5usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_timing_config_t),
                "::",
                stringify!(range_config__timeout_macrop_a_lo)
            )
        );
    }
    test_field_range_config__timeout_macrop_a_lo();
    fn test_field_range_config__vcsel_period_a() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).range_config__vcsel_period_a) as usize - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_timing_config_t),
                "::",
                stringify!(range_config__vcsel_period_a)
            )
        );
    }
    test_field_range_config__vcsel_period_a();
    fn test_field_range_config__timeout_macrop_b_hi() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).range_config__timeout_macrop_b_hi) as usize
                    - ptr as usize
            },
            7usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_timing_config_t),
                "::",
                stringify!(range_config__timeout_macrop_b_hi)
            )
        );
    }
    test_field_range_config__timeout_macrop_b_hi();
    fn test_field_range_config__timeout_macrop_b_lo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).range_config__timeout_macrop_b_lo) as usize
                    - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_timing_config_t),
                "::",
                stringify!(range_config__timeout_macrop_b_lo)
            )
        );
    }
    test_field_range_config__timeout_macrop_b_lo();
    fn test_field_range_config__vcsel_period_b() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).range_config__vcsel_period_b) as usize - ptr as usize
            },
            9usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_timing_config_t),
                "::",
                stringify!(range_config__vcsel_period_b)
            )
        );
    }
    test_field_range_config__vcsel_period_b();
    fn test_field_range_config__sigma_thresh() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).range_config__sigma_thresh) as usize - ptr as usize
            },
            10usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_timing_config_t),
                "::",
                stringify!(range_config__sigma_thresh)
            )
        );
    }
    test_field_range_config__sigma_thresh();
    fn test_field_range_config__min_count_rate_rtn_limit_mcps() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).range_config__min_count_rate_rtn_limit_mcps) as usize
                    - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_timing_config_t),
                "::",
                stringify!(range_config__min_count_rate_rtn_limit_mcps)
            )
        );
    }
    test_field_range_config__min_count_rate_rtn_limit_mcps();
    fn test_field_range_config__valid_phase_low() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).range_config__valid_phase_low) as usize - ptr as usize
            },
            14usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_timing_config_t),
                "::",
                stringify!(range_config__valid_phase_low)
            )
        );
    }
    test_field_range_config__valid_phase_low();
    fn test_field_range_config__valid_phase_high() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).range_config__valid_phase_high) as usize - ptr as usize
            },
            15usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_timing_config_t),
                "::",
                stringify!(range_config__valid_phase_high)
            )
        );
    }
    test_field_range_config__valid_phase_high();
    fn test_field_system__intermeasurement_period() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).system__intermeasurement_period) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_timing_config_t),
                "::",
                stringify!(system__intermeasurement_period)
            )
        );
    }
    test_field_system__intermeasurement_period();
    fn test_field_system__fractional_enable() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).system__fractional_enable) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_timing_config_t),
                "::",
                stringify!(system__fractional_enable)
            )
        );
    }
    test_field_system__fractional_enable();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct VL53LX_dynamic_config_t {
    system__grouped_parameter_hold_0: u8,
    system__thresh_high: u16,
    system__thresh_low: u16,
    system__enable_xtalk_per_quadrant: u8,
    system__seed_config: u8,
    sd_config__woi_sd0: u8,
    sd_config__woi_sd1: u8,
    sd_config__initial_phase_sd0: u8,
    sd_config__initial_phase_sd1: u8,
    system__grouped_parameter_hold_1: u8,
    sd_config__first_order_select: u8,
    sd_config__quantifier: u8,
    roi_config__user_roi_centre_spad: u8,
    roi_config__user_roi_requested_global_xy_size: u8,
    system__sequence_config: u8,
    system__grouped_parameter_hold: u8,
}
#[test]
fn bindgen_test_layout_VL53LX_dynamic_config_t() {
    assert_eq!(
        ::std::mem::size_of::<VL53LX_dynamic_config_t>(),
        20usize,
        concat!("Size of: ", stringify!(VL53LX_dynamic_config_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VL53LX_dynamic_config_t>(),
        2usize,
        concat!("Alignment of ", stringify!(VL53LX_dynamic_config_t))
    );
    fn test_field_system__grouped_parameter_hold_0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_dynamic_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).system__grouped_parameter_hold_0) as usize
                    - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_dynamic_config_t),
                "::",
                stringify!(system__grouped_parameter_hold_0)
            )
        );
    }
    test_field_system__grouped_parameter_hold_0();
    fn test_field_system__thresh_high() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_dynamic_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).system__thresh_high) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_dynamic_config_t),
                "::",
                stringify!(system__thresh_high)
            )
        );
    }
    test_field_system__thresh_high();
    fn test_field_system__thresh_low() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_dynamic_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).system__thresh_low) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_dynamic_config_t),
                "::",
                stringify!(system__thresh_low)
            )
        );
    }
    test_field_system__thresh_low();
    fn test_field_system__enable_xtalk_per_quadrant() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_dynamic_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).system__enable_xtalk_per_quadrant) as usize
                    - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_dynamic_config_t),
                "::",
                stringify!(system__enable_xtalk_per_quadrant)
            )
        );
    }
    test_field_system__enable_xtalk_per_quadrant();
    fn test_field_system__seed_config() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_dynamic_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).system__seed_config) as usize - ptr as usize
            },
            7usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_dynamic_config_t),
                "::",
                stringify!(system__seed_config)
            )
        );
    }
    test_field_system__seed_config();
    fn test_field_sd_config__woi_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_dynamic_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sd_config__woi_sd0) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_dynamic_config_t),
                "::",
                stringify!(sd_config__woi_sd0)
            )
        );
    }
    test_field_sd_config__woi_sd0();
    fn test_field_sd_config__woi_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_dynamic_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sd_config__woi_sd1) as usize - ptr as usize
            },
            9usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_dynamic_config_t),
                "::",
                stringify!(sd_config__woi_sd1)
            )
        );
    }
    test_field_sd_config__woi_sd1();
    fn test_field_sd_config__initial_phase_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_dynamic_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sd_config__initial_phase_sd0) as usize - ptr as usize
            },
            10usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_dynamic_config_t),
                "::",
                stringify!(sd_config__initial_phase_sd0)
            )
        );
    }
    test_field_sd_config__initial_phase_sd0();
    fn test_field_sd_config__initial_phase_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_dynamic_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sd_config__initial_phase_sd1) as usize - ptr as usize
            },
            11usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_dynamic_config_t),
                "::",
                stringify!(sd_config__initial_phase_sd1)
            )
        );
    }
    test_field_sd_config__initial_phase_sd1();
    fn test_field_system__grouped_parameter_hold_1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_dynamic_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).system__grouped_parameter_hold_1) as usize
                    - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_dynamic_config_t),
                "::",
                stringify!(system__grouped_parameter_hold_1)
            )
        );
    }
    test_field_system__grouped_parameter_hold_1();
    fn test_field_sd_config__first_order_select() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_dynamic_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sd_config__first_order_select) as usize - ptr as usize
            },
            13usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_dynamic_config_t),
                "::",
                stringify!(sd_config__first_order_select)
            )
        );
    }
    test_field_sd_config__first_order_select();
    fn test_field_sd_config__quantifier() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_dynamic_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sd_config__quantifier) as usize - ptr as usize
            },
            14usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_dynamic_config_t),
                "::",
                stringify!(sd_config__quantifier)
            )
        );
    }
    test_field_sd_config__quantifier();
    fn test_field_roi_config__user_roi_centre_spad() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_dynamic_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).roi_config__user_roi_centre_spad) as usize
                    - ptr as usize
            },
            15usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_dynamic_config_t),
                "::",
                stringify!(roi_config__user_roi_centre_spad)
            )
        );
    }
    test_field_roi_config__user_roi_centre_spad();
    fn test_field_roi_config__user_roi_requested_global_xy_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_dynamic_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).roi_config__user_roi_requested_global_xy_size) as usize
                    - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_dynamic_config_t),
                "::",
                stringify!(roi_config__user_roi_requested_global_xy_size)
            )
        );
    }
    test_field_roi_config__user_roi_requested_global_xy_size();
    fn test_field_system__sequence_config() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_dynamic_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).system__sequence_config) as usize - ptr as usize
            },
            17usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_dynamic_config_t),
                "::",
                stringify!(system__sequence_config)
            )
        );
    }
    test_field_system__sequence_config();
    fn test_field_system__grouped_parameter_hold() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_dynamic_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).system__grouped_parameter_hold) as usize - ptr as usize
            },
            18usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_dynamic_config_t),
                "::",
                stringify!(system__grouped_parameter_hold)
            )
        );
    }
    test_field_system__grouped_parameter_hold();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct VL53LX_system_control_t {
    power_management__go1_power_force: u8,
    system__stream_count_ctrl: u8,
    firmware__enable: u8,
    system__interrupt_clear: u8,
    system__mode_start: u8,
}
#[test]
fn bindgen_test_layout_VL53LX_system_control_t() {
    assert_eq!(
        ::std::mem::size_of::<VL53LX_system_control_t>(),
        5usize,
        concat!("Size of: ", stringify!(VL53LX_system_control_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VL53LX_system_control_t>(),
        1usize,
        concat!("Alignment of ", stringify!(VL53LX_system_control_t))
    );
    fn test_field_power_management__go1_power_force() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_control_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).power_management__go1_power_force) as usize
                    - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_control_t),
                "::",
                stringify!(power_management__go1_power_force)
            )
        );
    }
    test_field_power_management__go1_power_force();
    fn test_field_system__stream_count_ctrl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_control_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).system__stream_count_ctrl) as usize - ptr as usize
            },
            1usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_control_t),
                "::",
                stringify!(system__stream_count_ctrl)
            )
        );
    }
    test_field_system__stream_count_ctrl();
    fn test_field_firmware__enable() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_control_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).firmware__enable) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_control_t),
                "::",
                stringify!(firmware__enable)
            )
        );
    }
    test_field_firmware__enable();
    fn test_field_system__interrupt_clear() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_control_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).system__interrupt_clear) as usize - ptr as usize
            },
            3usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_control_t),
                "::",
                stringify!(system__interrupt_clear)
            )
        );
    }
    test_field_system__interrupt_clear();
    fn test_field_system__mode_start() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_control_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).system__mode_start) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_control_t),
                "::",
                stringify!(system__mode_start)
            )
        );
    }
    test_field_system__mode_start();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct VL53LX_system_results_t {
    result__interrupt_status: u8,
    result__range_status: u8,
    result__report_status: u8,
    result__stream_count: u8,
    result__dss_actual_effective_spads_sd0: u16,
    result__peak_signal_count_rate_mcps_sd0: u16,
    result__ambient_count_rate_mcps_sd0: u16,
    result__sigma_sd0: u16,
    result__phase_sd0: u16,
    result__final_crosstalk_corrected_range_mm_sd0: u16,
    result__peak_signal_count_rate_crosstalk_corrected_mcps_sd0: u16,
    result__mm_inner_actual_effective_spads_sd0: u16,
    result__mm_outer_actual_effective_spads_sd0: u16,
    result__avg_signal_count_rate_mcps_sd0: u16,
    result__dss_actual_effective_spads_sd1: u16,
    result__peak_signal_count_rate_mcps_sd1: u16,
    result__ambient_count_rate_mcps_sd1: u16,
    result__sigma_sd1: u16,
    result__phase_sd1: u16,
    result__final_crosstalk_corrected_range_mm_sd1: u16,
    result__spare_0_sd1: u16,
    result__spare_1_sd1: u16,
    result__spare_2_sd1: u16,
    result__spare_3_sd1: u8,
    result__thresh_info: u8,
}
#[test]
fn bindgen_test_layout_VL53LX_system_results_t() {
    assert_eq!(
        ::std::mem::size_of::<VL53LX_system_results_t>(),
        44usize,
        concat!("Size of: ", stringify!(VL53LX_system_results_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VL53LX_system_results_t>(),
        2usize,
        concat!("Alignment of ", stringify!(VL53LX_system_results_t))
    );
    fn test_field_result__interrupt_status() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__interrupt_status) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__interrupt_status)
            )
        );
    }
    test_field_result__interrupt_status();
    fn test_field_result__range_status() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__range_status) as usize - ptr as usize
            },
            1usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__range_status)
            )
        );
    }
    test_field_result__range_status();
    fn test_field_result__report_status() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__report_status) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__report_status)
            )
        );
    }
    test_field_result__report_status();
    fn test_field_result__stream_count() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__stream_count) as usize - ptr as usize
            },
            3usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__stream_count)
            )
        );
    }
    test_field_result__stream_count();
    fn test_field_result__dss_actual_effective_spads_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__dss_actual_effective_spads_sd0) as usize
                    - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__dss_actual_effective_spads_sd0)
            )
        );
    }
    test_field_result__dss_actual_effective_spads_sd0();
    fn test_field_result__peak_signal_count_rate_mcps_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__peak_signal_count_rate_mcps_sd0) as usize
                    - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__peak_signal_count_rate_mcps_sd0)
            )
        );
    }
    test_field_result__peak_signal_count_rate_mcps_sd0();
    fn test_field_result__ambient_count_rate_mcps_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__ambient_count_rate_mcps_sd0) as usize
                    - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__ambient_count_rate_mcps_sd0)
            )
        );
    }
    test_field_result__ambient_count_rate_mcps_sd0();
    fn test_field_result__sigma_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__sigma_sd0) as usize - ptr as usize
            },
            10usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__sigma_sd0)
            )
        );
    }
    test_field_result__sigma_sd0();
    fn test_field_result__phase_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__phase_sd0) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__phase_sd0)
            )
        );
    }
    test_field_result__phase_sd0();
    fn test_field_result__final_crosstalk_corrected_range_mm_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__final_crosstalk_corrected_range_mm_sd0) as usize
                    - ptr as usize
            },
            14usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__final_crosstalk_corrected_range_mm_sd0)
            )
        );
    }
    test_field_result__final_crosstalk_corrected_range_mm_sd0();
    fn test_field_result__peak_signal_count_rate_crosstalk_corrected_mcps_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!(
                    (*ptr).result__peak_signal_count_rate_crosstalk_corrected_mcps_sd0
                ) as usize
                    - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__peak_signal_count_rate_crosstalk_corrected_mcps_sd0)
            )
        );
    }
    test_field_result__peak_signal_count_rate_crosstalk_corrected_mcps_sd0();
    fn test_field_result__mm_inner_actual_effective_spads_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__mm_inner_actual_effective_spads_sd0) as usize
                    - ptr as usize
            },
            18usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__mm_inner_actual_effective_spads_sd0)
            )
        );
    }
    test_field_result__mm_inner_actual_effective_spads_sd0();
    fn test_field_result__mm_outer_actual_effective_spads_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__mm_outer_actual_effective_spads_sd0) as usize
                    - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__mm_outer_actual_effective_spads_sd0)
            )
        );
    }
    test_field_result__mm_outer_actual_effective_spads_sd0();
    fn test_field_result__avg_signal_count_rate_mcps_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__avg_signal_count_rate_mcps_sd0) as usize
                    - ptr as usize
            },
            22usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__avg_signal_count_rate_mcps_sd0)
            )
        );
    }
    test_field_result__avg_signal_count_rate_mcps_sd0();
    fn test_field_result__dss_actual_effective_spads_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__dss_actual_effective_spads_sd1) as usize
                    - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__dss_actual_effective_spads_sd1)
            )
        );
    }
    test_field_result__dss_actual_effective_spads_sd1();
    fn test_field_result__peak_signal_count_rate_mcps_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__peak_signal_count_rate_mcps_sd1) as usize
                    - ptr as usize
            },
            26usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__peak_signal_count_rate_mcps_sd1)
            )
        );
    }
    test_field_result__peak_signal_count_rate_mcps_sd1();
    fn test_field_result__ambient_count_rate_mcps_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__ambient_count_rate_mcps_sd1) as usize
                    - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__ambient_count_rate_mcps_sd1)
            )
        );
    }
    test_field_result__ambient_count_rate_mcps_sd1();
    fn test_field_result__sigma_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__sigma_sd1) as usize - ptr as usize
            },
            30usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__sigma_sd1)
            )
        );
    }
    test_field_result__sigma_sd1();
    fn test_field_result__phase_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__phase_sd1) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__phase_sd1)
            )
        );
    }
    test_field_result__phase_sd1();
    fn test_field_result__final_crosstalk_corrected_range_mm_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__final_crosstalk_corrected_range_mm_sd1) as usize
                    - ptr as usize
            },
            34usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__final_crosstalk_corrected_range_mm_sd1)
            )
        );
    }
    test_field_result__final_crosstalk_corrected_range_mm_sd1();
    fn test_field_result__spare_0_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__spare_0_sd1) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__spare_0_sd1)
            )
        );
    }
    test_field_result__spare_0_sd1();
    fn test_field_result__spare_1_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__spare_1_sd1) as usize - ptr as usize
            },
            38usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__spare_1_sd1)
            )
        );
    }
    test_field_result__spare_1_sd1();
    fn test_field_result__spare_2_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__spare_2_sd1) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__spare_2_sd1)
            )
        );
    }
    test_field_result__spare_2_sd1();
    fn test_field_result__spare_3_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__spare_3_sd1) as usize - ptr as usize
            },
            42usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__spare_3_sd1)
            )
        );
    }
    test_field_result__spare_3_sd1();
    fn test_field_result__thresh_info() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__thresh_info) as usize - ptr as usize
            },
            43usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_system_results_t),
                "::",
                stringify!(result__thresh_info)
            )
        );
    }
    test_field_result__thresh_info();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct VL53LX_core_results_t {
    result_core__ambient_window_events_sd0: u32,
    result_core__ranging_total_events_sd0: u32,
    result_core__signal_total_events_sd0: i32,
    result_core__total_periods_elapsed_sd0: u32,
    result_core__ambient_window_events_sd1: u32,
    result_core__ranging_total_events_sd1: u32,
    result_core__signal_total_events_sd1: i32,
    result_core__total_periods_elapsed_sd1: u32,
    result_core__spare_0: u8,
}
#[test]
fn bindgen_test_layout_VL53LX_core_results_t() {
    assert_eq!(
        ::std::mem::size_of::<VL53LX_core_results_t>(),
        36usize,
        concat!("Size of: ", stringify!(VL53LX_core_results_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VL53LX_core_results_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VL53LX_core_results_t))
    );
    fn test_field_result_core__ambient_window_events_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result_core__ambient_window_events_sd0) as usize
                    - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_core_results_t),
                "::",
                stringify!(result_core__ambient_window_events_sd0)
            )
        );
    }
    test_field_result_core__ambient_window_events_sd0();
    fn test_field_result_core__ranging_total_events_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result_core__ranging_total_events_sd0) as usize
                    - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_core_results_t),
                "::",
                stringify!(result_core__ranging_total_events_sd0)
            )
        );
    }
    test_field_result_core__ranging_total_events_sd0();
    fn test_field_result_core__signal_total_events_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result_core__signal_total_events_sd0) as usize
                    - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_core_results_t),
                "::",
                stringify!(result_core__signal_total_events_sd0)
            )
        );
    }
    test_field_result_core__signal_total_events_sd0();
    fn test_field_result_core__total_periods_elapsed_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result_core__total_periods_elapsed_sd0) as usize
                    - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_core_results_t),
                "::",
                stringify!(result_core__total_periods_elapsed_sd0)
            )
        );
    }
    test_field_result_core__total_periods_elapsed_sd0();
    fn test_field_result_core__ambient_window_events_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result_core__ambient_window_events_sd1) as usize
                    - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_core_results_t),
                "::",
                stringify!(result_core__ambient_window_events_sd1)
            )
        );
    }
    test_field_result_core__ambient_window_events_sd1();
    fn test_field_result_core__ranging_total_events_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result_core__ranging_total_events_sd1) as usize
                    - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_core_results_t),
                "::",
                stringify!(result_core__ranging_total_events_sd1)
            )
        );
    }
    test_field_result_core__ranging_total_events_sd1();
    fn test_field_result_core__signal_total_events_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result_core__signal_total_events_sd1) as usize
                    - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_core_results_t),
                "::",
                stringify!(result_core__signal_total_events_sd1)
            )
        );
    }
    test_field_result_core__signal_total_events_sd1();
    fn test_field_result_core__total_periods_elapsed_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result_core__total_periods_elapsed_sd1) as usize
                    - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_core_results_t),
                "::",
                stringify!(result_core__total_periods_elapsed_sd1)
            )
        );
    }
    test_field_result_core__total_periods_elapsed_sd1();
    fn test_field_result_core__spare_0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result_core__spare_0) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_core_results_t),
                "::",
                stringify!(result_core__spare_0)
            )
        );
    }
    test_field_result_core__spare_0();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct VL53LX_debug_results_t {
    phasecal_result__reference_phase: u16,
    phasecal_result__vcsel_start: u8,
    ref_spad_char_result__num_actual_ref_spads: u8,
    ref_spad_char_result__ref_location: u8,
    vhv_result__coldboot_status: u8,
    vhv_result__search_result: u8,
    vhv_result__latest_setting: u8,
    result__osc_calibrate_val: u16,
    ana_config__powerdown_go1: u8,
    ana_config__ref_bg_ctrl: u8,
    ana_config__regdvdd1v2_ctrl: u8,
    ana_config__osc_slow_ctrl: u8,
    test_mode__status: u8,
    firmware__system_status: u8,
    firmware__mode_status: u8,
    firmware__secondary_mode_status: u8,
    firmware__cal_repeat_rate_counter: u16,
    gph__system__thresh_high: u16,
    gph__system__thresh_low: u16,
    gph__system__enable_xtalk_per_quadrant: u8,
    gph__spare_0: u8,
    gph__sd_config__woi_sd0: u8,
    gph__sd_config__woi_sd1: u8,
    gph__sd_config__initial_phase_sd0: u8,
    gph__sd_config__initial_phase_sd1: u8,
    gph__sd_config__first_order_select: u8,
    gph__sd_config__quantifier: u8,
    gph__roi_config__user_roi_centre_spad: u8,
    gph__roi_config__user_roi_requested_global_xy_size: u8,
    gph__system__sequence_config: u8,
    gph__gph_id: u8,
    system__interrupt_set: u8,
    interrupt_manager__enables: u8,
    interrupt_manager__clear: u8,
    interrupt_manager__status: u8,
    mcu_to_host_bank__wr_access_en: u8,
    power_management__go1_reset_status: u8,
    pad_startup_mode__value_ro: u8,
    pad_startup_mode__value_ctrl: u8,
    pll_period_us: u32,
    interrupt_scheduler__data_out: u32,
    nvm_bist__complete: u8,
    nvm_bist__status: u8,
}
#[test]
fn bindgen_test_layout_VL53LX_debug_results_t() {
    assert_eq!(
        ::std::mem::size_of::<VL53LX_debug_results_t>(),
        56usize,
        concat!("Size of: ", stringify!(VL53LX_debug_results_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VL53LX_debug_results_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VL53LX_debug_results_t))
    );
    fn test_field_phasecal_result__reference_phase() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).phasecal_result__reference_phase) as usize
                    - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(phasecal_result__reference_phase)
            )
        );
    }
    test_field_phasecal_result__reference_phase();
    fn test_field_phasecal_result__vcsel_start() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).phasecal_result__vcsel_start) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(phasecal_result__vcsel_start)
            )
        );
    }
    test_field_phasecal_result__vcsel_start();
    fn test_field_ref_spad_char_result__num_actual_ref_spads() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ref_spad_char_result__num_actual_ref_spads) as usize
                    - ptr as usize
            },
            3usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(ref_spad_char_result__num_actual_ref_spads)
            )
        );
    }
    test_field_ref_spad_char_result__num_actual_ref_spads();
    fn test_field_ref_spad_char_result__ref_location() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ref_spad_char_result__ref_location) as usize
                    - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(ref_spad_char_result__ref_location)
            )
        );
    }
    test_field_ref_spad_char_result__ref_location();
    fn test_field_vhv_result__coldboot_status() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vhv_result__coldboot_status) as usize - ptr as usize
            },
            5usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(vhv_result__coldboot_status)
            )
        );
    }
    test_field_vhv_result__coldboot_status();
    fn test_field_vhv_result__search_result() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vhv_result__search_result) as usize - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(vhv_result__search_result)
            )
        );
    }
    test_field_vhv_result__search_result();
    fn test_field_vhv_result__latest_setting() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vhv_result__latest_setting) as usize - ptr as usize
            },
            7usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(vhv_result__latest_setting)
            )
        );
    }
    test_field_vhv_result__latest_setting();
    fn test_field_result__osc_calibrate_val() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__osc_calibrate_val) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(result__osc_calibrate_val)
            )
        );
    }
    test_field_result__osc_calibrate_val();
    fn test_field_ana_config__powerdown_go1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ana_config__powerdown_go1) as usize - ptr as usize
            },
            10usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(ana_config__powerdown_go1)
            )
        );
    }
    test_field_ana_config__powerdown_go1();
    fn test_field_ana_config__ref_bg_ctrl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ana_config__ref_bg_ctrl) as usize - ptr as usize
            },
            11usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(ana_config__ref_bg_ctrl)
            )
        );
    }
    test_field_ana_config__ref_bg_ctrl();
    fn test_field_ana_config__regdvdd1v2_ctrl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ana_config__regdvdd1v2_ctrl) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(ana_config__regdvdd1v2_ctrl)
            )
        );
    }
    test_field_ana_config__regdvdd1v2_ctrl();
    fn test_field_ana_config__osc_slow_ctrl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ana_config__osc_slow_ctrl) as usize - ptr as usize
            },
            13usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(ana_config__osc_slow_ctrl)
            )
        );
    }
    test_field_ana_config__osc_slow_ctrl();
    fn test_field_test_mode__status() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).test_mode__status) as usize - ptr as usize
            },
            14usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(test_mode__status)
            )
        );
    }
    test_field_test_mode__status();
    fn test_field_firmware__system_status() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).firmware__system_status) as usize - ptr as usize
            },
            15usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(firmware__system_status)
            )
        );
    }
    test_field_firmware__system_status();
    fn test_field_firmware__mode_status() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).firmware__mode_status) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(firmware__mode_status)
            )
        );
    }
    test_field_firmware__mode_status();
    fn test_field_firmware__secondary_mode_status() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).firmware__secondary_mode_status) as usize - ptr as usize
            },
            17usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(firmware__secondary_mode_status)
            )
        );
    }
    test_field_firmware__secondary_mode_status();
    fn test_field_firmware__cal_repeat_rate_counter() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).firmware__cal_repeat_rate_counter) as usize
                    - ptr as usize
            },
            18usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(firmware__cal_repeat_rate_counter)
            )
        );
    }
    test_field_firmware__cal_repeat_rate_counter();
    fn test_field_gph__system__thresh_high() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__system__thresh_high) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(gph__system__thresh_high)
            )
        );
    }
    test_field_gph__system__thresh_high();
    fn test_field_gph__system__thresh_low() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__system__thresh_low) as usize - ptr as usize
            },
            22usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(gph__system__thresh_low)
            )
        );
    }
    test_field_gph__system__thresh_low();
    fn test_field_gph__system__enable_xtalk_per_quadrant() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__system__enable_xtalk_per_quadrant) as usize
                    - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(gph__system__enable_xtalk_per_quadrant)
            )
        );
    }
    test_field_gph__system__enable_xtalk_per_quadrant();
    fn test_field_gph__spare_0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__spare_0) as usize - ptr as usize
            },
            25usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(gph__spare_0)
            )
        );
    }
    test_field_gph__spare_0();
    fn test_field_gph__sd_config__woi_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__sd_config__woi_sd0) as usize - ptr as usize
            },
            26usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(gph__sd_config__woi_sd0)
            )
        );
    }
    test_field_gph__sd_config__woi_sd0();
    fn test_field_gph__sd_config__woi_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__sd_config__woi_sd1) as usize - ptr as usize
            },
            27usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(gph__sd_config__woi_sd1)
            )
        );
    }
    test_field_gph__sd_config__woi_sd1();
    fn test_field_gph__sd_config__initial_phase_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__sd_config__initial_phase_sd0) as usize
                    - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(gph__sd_config__initial_phase_sd0)
            )
        );
    }
    test_field_gph__sd_config__initial_phase_sd0();
    fn test_field_gph__sd_config__initial_phase_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__sd_config__initial_phase_sd1) as usize
                    - ptr as usize
            },
            29usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(gph__sd_config__initial_phase_sd1)
            )
        );
    }
    test_field_gph__sd_config__initial_phase_sd1();
    fn test_field_gph__sd_config__first_order_select() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__sd_config__first_order_select) as usize
                    - ptr as usize
            },
            30usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(gph__sd_config__first_order_select)
            )
        );
    }
    test_field_gph__sd_config__first_order_select();
    fn test_field_gph__sd_config__quantifier() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__sd_config__quantifier) as usize - ptr as usize
            },
            31usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(gph__sd_config__quantifier)
            )
        );
    }
    test_field_gph__sd_config__quantifier();
    fn test_field_gph__roi_config__user_roi_centre_spad() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__roi_config__user_roi_centre_spad) as usize
                    - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(gph__roi_config__user_roi_centre_spad)
            )
        );
    }
    test_field_gph__roi_config__user_roi_centre_spad();
    fn test_field_gph__roi_config__user_roi_requested_global_xy_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__roi_config__user_roi_requested_global_xy_size)
                    as usize
                    - ptr as usize
            },
            33usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(gph__roi_config__user_roi_requested_global_xy_size)
            )
        );
    }
    test_field_gph__roi_config__user_roi_requested_global_xy_size();
    fn test_field_gph__system__sequence_config() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__system__sequence_config) as usize - ptr as usize
            },
            34usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(gph__system__sequence_config)
            )
        );
    }
    test_field_gph__system__sequence_config();
    fn test_field_gph__gph_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__gph_id) as usize - ptr as usize
            },
            35usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(gph__gph_id)
            )
        );
    }
    test_field_gph__gph_id();
    fn test_field_system__interrupt_set() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).system__interrupt_set) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(system__interrupt_set)
            )
        );
    }
    test_field_system__interrupt_set();
    fn test_field_interrupt_manager__enables() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).interrupt_manager__enables) as usize - ptr as usize
            },
            37usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(interrupt_manager__enables)
            )
        );
    }
    test_field_interrupt_manager__enables();
    fn test_field_interrupt_manager__clear() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).interrupt_manager__clear) as usize - ptr as usize
            },
            38usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(interrupt_manager__clear)
            )
        );
    }
    test_field_interrupt_manager__clear();
    fn test_field_interrupt_manager__status() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).interrupt_manager__status) as usize - ptr as usize
            },
            39usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(interrupt_manager__status)
            )
        );
    }
    test_field_interrupt_manager__status();
    fn test_field_mcu_to_host_bank__wr_access_en() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mcu_to_host_bank__wr_access_en) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(mcu_to_host_bank__wr_access_en)
            )
        );
    }
    test_field_mcu_to_host_bank__wr_access_en();
    fn test_field_power_management__go1_reset_status() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).power_management__go1_reset_status) as usize
                    - ptr as usize
            },
            41usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(power_management__go1_reset_status)
            )
        );
    }
    test_field_power_management__go1_reset_status();
    fn test_field_pad_startup_mode__value_ro() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pad_startup_mode__value_ro) as usize - ptr as usize
            },
            42usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(pad_startup_mode__value_ro)
            )
        );
    }
    test_field_pad_startup_mode__value_ro();
    fn test_field_pad_startup_mode__value_ctrl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pad_startup_mode__value_ctrl) as usize - ptr as usize
            },
            43usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(pad_startup_mode__value_ctrl)
            )
        );
    }
    test_field_pad_startup_mode__value_ctrl();
    fn test_field_pll_period_us() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pll_period_us) as usize - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(pll_period_us)
            )
        );
    }
    test_field_pll_period_us();
    fn test_field_interrupt_scheduler__data_out() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).interrupt_scheduler__data_out) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(interrupt_scheduler__data_out)
            )
        );
    }
    test_field_interrupt_scheduler__data_out();
    fn test_field_nvm_bist__complete() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nvm_bist__complete) as usize - ptr as usize
            },
            52usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(nvm_bist__complete)
            )
        );
    }
    test_field_nvm_bist__complete();
    fn test_field_nvm_bist__status() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_debug_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nvm_bist__status) as usize - ptr as usize
            },
            53usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_debug_results_t),
                "::",
                stringify!(nvm_bist__status)
            )
        );
    }
    test_field_nvm_bist__status();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct VL53LX_nvm_copy_data_t {
    identification__model_id: u8,
    identification__module_type: u8,
    identification__revision_id: u8,
    identification__module_id: u16,
    ana_config__fast_osc__trim_max: u8,
    ana_config__fast_osc__freq_set: u8,
    ana_config__vcsel_trim: u8,
    ana_config__vcsel_selion: u8,
    ana_config__vcsel_selion_max: u8,
    protected_laser_safety__lock_bit: u8,
    laser_safety__key: u8,
    laser_safety__key_ro: u8,
    laser_safety__clip: u8,
    laser_safety__mult: u8,
    global_config__spad_enables_rtn_0: u8,
    global_config__spad_enables_rtn_1: u8,
    global_config__spad_enables_rtn_2: u8,
    global_config__spad_enables_rtn_3: u8,
    global_config__spad_enables_rtn_4: u8,
    global_config__spad_enables_rtn_5: u8,
    global_config__spad_enables_rtn_6: u8,
    global_config__spad_enables_rtn_7: u8,
    global_config__spad_enables_rtn_8: u8,
    global_config__spad_enables_rtn_9: u8,
    global_config__spad_enables_rtn_10: u8,
    global_config__spad_enables_rtn_11: u8,
    global_config__spad_enables_rtn_12: u8,
    global_config__spad_enables_rtn_13: u8,
    global_config__spad_enables_rtn_14: u8,
    global_config__spad_enables_rtn_15: u8,
    global_config__spad_enables_rtn_16: u8,
    global_config__spad_enables_rtn_17: u8,
    global_config__spad_enables_rtn_18: u8,
    global_config__spad_enables_rtn_19: u8,
    global_config__spad_enables_rtn_20: u8,
    global_config__spad_enables_rtn_21: u8,
    global_config__spad_enables_rtn_22: u8,
    global_config__spad_enables_rtn_23: u8,
    global_config__spad_enables_rtn_24: u8,
    global_config__spad_enables_rtn_25: u8,
    global_config__spad_enables_rtn_26: u8,
    global_config__spad_enables_rtn_27: u8,
    global_config__spad_enables_rtn_28: u8,
    global_config__spad_enables_rtn_29: u8,
    global_config__spad_enables_rtn_30: u8,
    global_config__spad_enables_rtn_31: u8,
    roi_config__mode_roi_centre_spad: u8,
    roi_config__mode_roi_xy_size: u8,
}
#[test]
fn bindgen_test_layout_VL53LX_nvm_copy_data_t() {
    assert_eq!(
        ::std::mem::size_of::<VL53LX_nvm_copy_data_t>(),
        50usize,
        concat!("Size of: ", stringify!(VL53LX_nvm_copy_data_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VL53LX_nvm_copy_data_t>(),
        2usize,
        concat!("Alignment of ", stringify!(VL53LX_nvm_copy_data_t))
    );
    fn test_field_identification__model_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).identification__model_id) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(identification__model_id)
            )
        );
    }
    test_field_identification__model_id();
    fn test_field_identification__module_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).identification__module_type) as usize - ptr as usize
            },
            1usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(identification__module_type)
            )
        );
    }
    test_field_identification__module_type();
    fn test_field_identification__revision_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).identification__revision_id) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(identification__revision_id)
            )
        );
    }
    test_field_identification__revision_id();
    fn test_field_identification__module_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).identification__module_id) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(identification__module_id)
            )
        );
    }
    test_field_identification__module_id();
    fn test_field_ana_config__fast_osc__trim_max() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ana_config__fast_osc__trim_max) as usize - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(ana_config__fast_osc__trim_max)
            )
        );
    }
    test_field_ana_config__fast_osc__trim_max();
    fn test_field_ana_config__fast_osc__freq_set() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ana_config__fast_osc__freq_set) as usize - ptr as usize
            },
            7usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(ana_config__fast_osc__freq_set)
            )
        );
    }
    test_field_ana_config__fast_osc__freq_set();
    fn test_field_ana_config__vcsel_trim() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ana_config__vcsel_trim) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(ana_config__vcsel_trim)
            )
        );
    }
    test_field_ana_config__vcsel_trim();
    fn test_field_ana_config__vcsel_selion() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ana_config__vcsel_selion) as usize - ptr as usize
            },
            9usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(ana_config__vcsel_selion)
            )
        );
    }
    test_field_ana_config__vcsel_selion();
    fn test_field_ana_config__vcsel_selion_max() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ana_config__vcsel_selion_max) as usize - ptr as usize
            },
            10usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(ana_config__vcsel_selion_max)
            )
        );
    }
    test_field_ana_config__vcsel_selion_max();
    fn test_field_protected_laser_safety__lock_bit() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).protected_laser_safety__lock_bit) as usize
                    - ptr as usize
            },
            11usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(protected_laser_safety__lock_bit)
            )
        );
    }
    test_field_protected_laser_safety__lock_bit();
    fn test_field_laser_safety__key() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).laser_safety__key) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(laser_safety__key)
            )
        );
    }
    test_field_laser_safety__key();
    fn test_field_laser_safety__key_ro() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).laser_safety__key_ro) as usize - ptr as usize
            },
            13usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(laser_safety__key_ro)
            )
        );
    }
    test_field_laser_safety__key_ro();
    fn test_field_laser_safety__clip() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).laser_safety__clip) as usize - ptr as usize
            },
            14usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(laser_safety__clip)
            )
        );
    }
    test_field_laser_safety__clip();
    fn test_field_laser_safety__mult() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).laser_safety__mult) as usize - ptr as usize
            },
            15usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(laser_safety__mult)
            )
        );
    }
    test_field_laser_safety__mult();
    fn test_field_global_config__spad_enables_rtn_0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_0) as usize
                    - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_0)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_0();
    fn test_field_global_config__spad_enables_rtn_1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_1) as usize
                    - ptr as usize
            },
            17usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_1)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_1();
    fn test_field_global_config__spad_enables_rtn_2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_2) as usize
                    - ptr as usize
            },
            18usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_2)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_2();
    fn test_field_global_config__spad_enables_rtn_3() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_3) as usize
                    - ptr as usize
            },
            19usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_3)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_3();
    fn test_field_global_config__spad_enables_rtn_4() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_4) as usize
                    - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_4)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_4();
    fn test_field_global_config__spad_enables_rtn_5() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_5) as usize
                    - ptr as usize
            },
            21usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_5)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_5();
    fn test_field_global_config__spad_enables_rtn_6() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_6) as usize
                    - ptr as usize
            },
            22usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_6)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_6();
    fn test_field_global_config__spad_enables_rtn_7() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_7) as usize
                    - ptr as usize
            },
            23usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_7)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_7();
    fn test_field_global_config__spad_enables_rtn_8() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_8) as usize
                    - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_8)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_8();
    fn test_field_global_config__spad_enables_rtn_9() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_9) as usize
                    - ptr as usize
            },
            25usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_9)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_9();
    fn test_field_global_config__spad_enables_rtn_10() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_10) as usize
                    - ptr as usize
            },
            26usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_10)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_10();
    fn test_field_global_config__spad_enables_rtn_11() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_11) as usize
                    - ptr as usize
            },
            27usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_11)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_11();
    fn test_field_global_config__spad_enables_rtn_12() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_12) as usize
                    - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_12)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_12();
    fn test_field_global_config__spad_enables_rtn_13() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_13) as usize
                    - ptr as usize
            },
            29usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_13)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_13();
    fn test_field_global_config__spad_enables_rtn_14() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_14) as usize
                    - ptr as usize
            },
            30usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_14)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_14();
    fn test_field_global_config__spad_enables_rtn_15() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_15) as usize
                    - ptr as usize
            },
            31usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_15)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_15();
    fn test_field_global_config__spad_enables_rtn_16() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_16) as usize
                    - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_16)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_16();
    fn test_field_global_config__spad_enables_rtn_17() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_17) as usize
                    - ptr as usize
            },
            33usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_17)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_17();
    fn test_field_global_config__spad_enables_rtn_18() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_18) as usize
                    - ptr as usize
            },
            34usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_18)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_18();
    fn test_field_global_config__spad_enables_rtn_19() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_19) as usize
                    - ptr as usize
            },
            35usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_19)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_19();
    fn test_field_global_config__spad_enables_rtn_20() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_20) as usize
                    - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_20)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_20();
    fn test_field_global_config__spad_enables_rtn_21() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_21) as usize
                    - ptr as usize
            },
            37usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_21)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_21();
    fn test_field_global_config__spad_enables_rtn_22() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_22) as usize
                    - ptr as usize
            },
            38usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_22)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_22();
    fn test_field_global_config__spad_enables_rtn_23() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_23) as usize
                    - ptr as usize
            },
            39usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_23)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_23();
    fn test_field_global_config__spad_enables_rtn_24() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_24) as usize
                    - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_24)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_24();
    fn test_field_global_config__spad_enables_rtn_25() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_25) as usize
                    - ptr as usize
            },
            41usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_25)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_25();
    fn test_field_global_config__spad_enables_rtn_26() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_26) as usize
                    - ptr as usize
            },
            42usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_26)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_26();
    fn test_field_global_config__spad_enables_rtn_27() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_27) as usize
                    - ptr as usize
            },
            43usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_27)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_27();
    fn test_field_global_config__spad_enables_rtn_28() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_28) as usize
                    - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_28)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_28();
    fn test_field_global_config__spad_enables_rtn_29() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_29) as usize
                    - ptr as usize
            },
            45usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_29)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_29();
    fn test_field_global_config__spad_enables_rtn_30() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_30) as usize
                    - ptr as usize
            },
            46usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_30)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_30();
    fn test_field_global_config__spad_enables_rtn_31() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).global_config__spad_enables_rtn_31) as usize
                    - ptr as usize
            },
            47usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(global_config__spad_enables_rtn_31)
            )
        );
    }
    test_field_global_config__spad_enables_rtn_31();
    fn test_field_roi_config__mode_roi_centre_spad() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).roi_config__mode_roi_centre_spad) as usize
                    - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(roi_config__mode_roi_centre_spad)
            )
        );
    }
    test_field_roi_config__mode_roi_centre_spad();
    fn test_field_roi_config__mode_roi_xy_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_nvm_copy_data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).roi_config__mode_roi_xy_size) as usize - ptr as usize
            },
            49usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_nvm_copy_data_t),
                "::",
                stringify!(roi_config__mode_roi_xy_size)
            )
        );
    }
    test_field_roi_config__mode_roi_xy_size();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct VL53LX_prev_shadow_system_results_t {
    prev_shadow_result__interrupt_status: u8,
    prev_shadow_result__range_status: u8,
    prev_shadow_result__report_status: u8,
    prev_shadow_result__stream_count: u8,
    prev_shadow_result__dss_actual_effective_spads_sd0: u16,
    prev_shadow_result__peak_signal_count_rate_mcps_sd0: u16,
    prev_shadow_result__ambient_count_rate_mcps_sd0: u16,
    prev_shadow_result__sigma_sd0: u16,
    prev_shadow_result__phase_sd0: u16,
    prev_shadow_result__final_crosstalk_corrected_range_mm_sd0: u16,
    psr__peak_signal_count_rate_crosstalk_corrected_mcps_sd0: u16,
    prev_shadow_result__mm_inner_actual_effective_spads_sd0: u16,
    prev_shadow_result__mm_outer_actual_effective_spads_sd0: u16,
    prev_shadow_result__avg_signal_count_rate_mcps_sd0: u16,
    prev_shadow_result__dss_actual_effective_spads_sd1: u16,
    prev_shadow_result__peak_signal_count_rate_mcps_sd1: u16,
    prev_shadow_result__ambient_count_rate_mcps_sd1: u16,
    prev_shadow_result__sigma_sd1: u16,
    prev_shadow_result__phase_sd1: u16,
    prev_shadow_result__final_crosstalk_corrected_range_mm_sd1: u16,
    prev_shadow_result__spare_0_sd1: u16,
    prev_shadow_result__spare_1_sd1: u16,
    prev_shadow_result__spare_2_sd1: u16,
    prev_shadow_result__spare_3_sd1: u16,
}
#[test]
fn bindgen_test_layout_VL53LX_prev_shadow_system_results_t() {
    assert_eq!(
        ::std::mem::size_of::<VL53LX_prev_shadow_system_results_t>(),
        44usize,
        concat!("Size of: ", stringify!(VL53LX_prev_shadow_system_results_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VL53LX_prev_shadow_system_results_t>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(VL53LX_prev_shadow_system_results_t)
        )
    );
    fn test_field_prev_shadow_result__interrupt_status() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_prev_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result__interrupt_status) as usize
                    - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_system_results_t),
                "::",
                stringify!(prev_shadow_result__interrupt_status)
            )
        );
    }
    test_field_prev_shadow_result__interrupt_status();
    fn test_field_prev_shadow_result__range_status() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_prev_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result__range_status) as usize
                    - ptr as usize
            },
            1usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_system_results_t),
                "::",
                stringify!(prev_shadow_result__range_status)
            )
        );
    }
    test_field_prev_shadow_result__range_status();
    fn test_field_prev_shadow_result__report_status() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_prev_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result__report_status) as usize
                    - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_system_results_t),
                "::",
                stringify!(prev_shadow_result__report_status)
            )
        );
    }
    test_field_prev_shadow_result__report_status();
    fn test_field_prev_shadow_result__stream_count() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_prev_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result__stream_count) as usize
                    - ptr as usize
            },
            3usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_system_results_t),
                "::",
                stringify!(prev_shadow_result__stream_count)
            )
        );
    }
    test_field_prev_shadow_result__stream_count();
    fn test_field_prev_shadow_result__dss_actual_effective_spads_sd0() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_prev_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result__dss_actual_effective_spads_sd0)
                    as usize
                    - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_system_results_t),
                "::",
                stringify!(prev_shadow_result__dss_actual_effective_spads_sd0)
            )
        );
    }
    test_field_prev_shadow_result__dss_actual_effective_spads_sd0();
    fn test_field_prev_shadow_result__peak_signal_count_rate_mcps_sd0() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_prev_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result__peak_signal_count_rate_mcps_sd0)
                    as usize
                    - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_system_results_t),
                "::",
                stringify!(prev_shadow_result__peak_signal_count_rate_mcps_sd0)
            )
        );
    }
    test_field_prev_shadow_result__peak_signal_count_rate_mcps_sd0();
    fn test_field_prev_shadow_result__ambient_count_rate_mcps_sd0() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_prev_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result__ambient_count_rate_mcps_sd0)
                    as usize
                    - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_system_results_t),
                "::",
                stringify!(prev_shadow_result__ambient_count_rate_mcps_sd0)
            )
        );
    }
    test_field_prev_shadow_result__ambient_count_rate_mcps_sd0();
    fn test_field_prev_shadow_result__sigma_sd0() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_prev_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result__sigma_sd0) as usize - ptr as usize
            },
            10usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_system_results_t),
                "::",
                stringify!(prev_shadow_result__sigma_sd0)
            )
        );
    }
    test_field_prev_shadow_result__sigma_sd0();
    fn test_field_prev_shadow_result__phase_sd0() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_prev_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result__phase_sd0) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_system_results_t),
                "::",
                stringify!(prev_shadow_result__phase_sd0)
            )
        );
    }
    test_field_prev_shadow_result__phase_sd0();
    fn test_field_prev_shadow_result__final_crosstalk_corrected_range_mm_sd0() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_prev_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!(
                    (*ptr).prev_shadow_result__final_crosstalk_corrected_range_mm_sd0
                ) as usize
                    - ptr as usize
            },
            14usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_system_results_t),
                "::",
                stringify!(prev_shadow_result__final_crosstalk_corrected_range_mm_sd0)
            )
        );
    }
    test_field_prev_shadow_result__final_crosstalk_corrected_range_mm_sd0();
    fn test_field_psr__peak_signal_count_rate_crosstalk_corrected_mcps_sd0() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_prev_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!(
                    (*ptr).psr__peak_signal_count_rate_crosstalk_corrected_mcps_sd0
                ) as usize
                    - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_system_results_t),
                "::",
                stringify!(psr__peak_signal_count_rate_crosstalk_corrected_mcps_sd0)
            )
        );
    }
    test_field_psr__peak_signal_count_rate_crosstalk_corrected_mcps_sd0();
    fn test_field_prev_shadow_result__mm_inner_actual_effective_spads_sd0() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_prev_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result__mm_inner_actual_effective_spads_sd0)
                    as usize
                    - ptr as usize
            },
            18usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_system_results_t),
                "::",
                stringify!(prev_shadow_result__mm_inner_actual_effective_spads_sd0)
            )
        );
    }
    test_field_prev_shadow_result__mm_inner_actual_effective_spads_sd0();
    fn test_field_prev_shadow_result__mm_outer_actual_effective_spads_sd0() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_prev_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result__mm_outer_actual_effective_spads_sd0)
                    as usize
                    - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_system_results_t),
                "::",
                stringify!(prev_shadow_result__mm_outer_actual_effective_spads_sd0)
            )
        );
    }
    test_field_prev_shadow_result__mm_outer_actual_effective_spads_sd0();
    fn test_field_prev_shadow_result__avg_signal_count_rate_mcps_sd0() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_prev_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result__avg_signal_count_rate_mcps_sd0)
                    as usize
                    - ptr as usize
            },
            22usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_system_results_t),
                "::",
                stringify!(prev_shadow_result__avg_signal_count_rate_mcps_sd0)
            )
        );
    }
    test_field_prev_shadow_result__avg_signal_count_rate_mcps_sd0();
    fn test_field_prev_shadow_result__dss_actual_effective_spads_sd1() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_prev_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result__dss_actual_effective_spads_sd1)
                    as usize
                    - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_system_results_t),
                "::",
                stringify!(prev_shadow_result__dss_actual_effective_spads_sd1)
            )
        );
    }
    test_field_prev_shadow_result__dss_actual_effective_spads_sd1();
    fn test_field_prev_shadow_result__peak_signal_count_rate_mcps_sd1() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_prev_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result__peak_signal_count_rate_mcps_sd1)
                    as usize
                    - ptr as usize
            },
            26usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_system_results_t),
                "::",
                stringify!(prev_shadow_result__peak_signal_count_rate_mcps_sd1)
            )
        );
    }
    test_field_prev_shadow_result__peak_signal_count_rate_mcps_sd1();
    fn test_field_prev_shadow_result__ambient_count_rate_mcps_sd1() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_prev_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result__ambient_count_rate_mcps_sd1)
                    as usize
                    - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_system_results_t),
                "::",
                stringify!(prev_shadow_result__ambient_count_rate_mcps_sd1)
            )
        );
    }
    test_field_prev_shadow_result__ambient_count_rate_mcps_sd1();
    fn test_field_prev_shadow_result__sigma_sd1() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_prev_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result__sigma_sd1) as usize - ptr as usize
            },
            30usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_system_results_t),
                "::",
                stringify!(prev_shadow_result__sigma_sd1)
            )
        );
    }
    test_field_prev_shadow_result__sigma_sd1();
    fn test_field_prev_shadow_result__phase_sd1() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_prev_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result__phase_sd1) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_system_results_t),
                "::",
                stringify!(prev_shadow_result__phase_sd1)
            )
        );
    }
    test_field_prev_shadow_result__phase_sd1();
    fn test_field_prev_shadow_result__final_crosstalk_corrected_range_mm_sd1() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_prev_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!(
                    (*ptr).prev_shadow_result__final_crosstalk_corrected_range_mm_sd1
                ) as usize
                    - ptr as usize
            },
            34usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_system_results_t),
                "::",
                stringify!(prev_shadow_result__final_crosstalk_corrected_range_mm_sd1)
            )
        );
    }
    test_field_prev_shadow_result__final_crosstalk_corrected_range_mm_sd1();
    fn test_field_prev_shadow_result__spare_0_sd1() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_prev_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result__spare_0_sd1) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_system_results_t),
                "::",
                stringify!(prev_shadow_result__spare_0_sd1)
            )
        );
    }
    test_field_prev_shadow_result__spare_0_sd1();
    fn test_field_prev_shadow_result__spare_1_sd1() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_prev_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result__spare_1_sd1) as usize - ptr as usize
            },
            38usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_system_results_t),
                "::",
                stringify!(prev_shadow_result__spare_1_sd1)
            )
        );
    }
    test_field_prev_shadow_result__spare_1_sd1();
    fn test_field_prev_shadow_result__spare_2_sd1() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_prev_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result__spare_2_sd1) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_system_results_t),
                "::",
                stringify!(prev_shadow_result__spare_2_sd1)
            )
        );
    }
    test_field_prev_shadow_result__spare_2_sd1();
    fn test_field_prev_shadow_result__spare_3_sd1() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VL53LX_prev_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result__spare_3_sd1) as usize - ptr as usize
            },
            42usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_system_results_t),
                "::",
                stringify!(prev_shadow_result__spare_3_sd1)
            )
        );
    }
    test_field_prev_shadow_result__spare_3_sd1();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct VL53LX_prev_shadow_core_results_t {
    prev_shadow_result_core__ambient_window_events_sd0: u32,
    prev_shadow_result_core__ranging_total_events_sd0: u32,
    prev_shadow_result_core__signal_total_events_sd0: i32,
    prev_shadow_result_core__total_periods_elapsed_sd0: u32,
    prev_shadow_result_core__ambient_window_events_sd1: u32,
    prev_shadow_result_core__ranging_total_events_sd1: u32,
    prev_shadow_result_core__signal_total_events_sd1: i32,
    prev_shadow_result_core__total_periods_elapsed_sd1: u32,
    prev_shadow_result_core__spare_0: u8,
}
#[test]
fn bindgen_test_layout_VL53LX_prev_shadow_core_results_t() {
    assert_eq!(
        ::std::mem::size_of::<VL53LX_prev_shadow_core_results_t>(),
        36usize,
        concat!("Size of: ", stringify!(VL53LX_prev_shadow_core_results_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VL53LX_prev_shadow_core_results_t>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(VL53LX_prev_shadow_core_results_t)
        )
    );
    fn test_field_prev_shadow_result_core__ambient_window_events_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_prev_shadow_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result_core__ambient_window_events_sd0)
                    as usize
                    - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_core_results_t),
                "::",
                stringify!(prev_shadow_result_core__ambient_window_events_sd0)
            )
        );
    }
    test_field_prev_shadow_result_core__ambient_window_events_sd0();
    fn test_field_prev_shadow_result_core__ranging_total_events_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_prev_shadow_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result_core__ranging_total_events_sd0)
                    as usize
                    - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_core_results_t),
                "::",
                stringify!(prev_shadow_result_core__ranging_total_events_sd0)
            )
        );
    }
    test_field_prev_shadow_result_core__ranging_total_events_sd0();
    fn test_field_prev_shadow_result_core__signal_total_events_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_prev_shadow_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result_core__signal_total_events_sd0)
                    as usize
                    - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_core_results_t),
                "::",
                stringify!(prev_shadow_result_core__signal_total_events_sd0)
            )
        );
    }
    test_field_prev_shadow_result_core__signal_total_events_sd0();
    fn test_field_prev_shadow_result_core__total_periods_elapsed_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_prev_shadow_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result_core__total_periods_elapsed_sd0)
                    as usize
                    - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_core_results_t),
                "::",
                stringify!(prev_shadow_result_core__total_periods_elapsed_sd0)
            )
        );
    }
    test_field_prev_shadow_result_core__total_periods_elapsed_sd0();
    fn test_field_prev_shadow_result_core__ambient_window_events_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_prev_shadow_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result_core__ambient_window_events_sd1)
                    as usize
                    - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_core_results_t),
                "::",
                stringify!(prev_shadow_result_core__ambient_window_events_sd1)
            )
        );
    }
    test_field_prev_shadow_result_core__ambient_window_events_sd1();
    fn test_field_prev_shadow_result_core__ranging_total_events_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_prev_shadow_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result_core__ranging_total_events_sd1)
                    as usize
                    - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_core_results_t),
                "::",
                stringify!(prev_shadow_result_core__ranging_total_events_sd1)
            )
        );
    }
    test_field_prev_shadow_result_core__ranging_total_events_sd1();
    fn test_field_prev_shadow_result_core__signal_total_events_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_prev_shadow_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result_core__signal_total_events_sd1)
                    as usize
                    - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_core_results_t),
                "::",
                stringify!(prev_shadow_result_core__signal_total_events_sd1)
            )
        );
    }
    test_field_prev_shadow_result_core__signal_total_events_sd1();
    fn test_field_prev_shadow_result_core__total_periods_elapsed_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_prev_shadow_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result_core__total_periods_elapsed_sd1)
                    as usize
                    - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_core_results_t),
                "::",
                stringify!(prev_shadow_result_core__total_periods_elapsed_sd1)
            )
        );
    }
    test_field_prev_shadow_result_core__total_periods_elapsed_sd1();
    fn test_field_prev_shadow_result_core__spare_0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_prev_shadow_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev_shadow_result_core__spare_0) as usize
                    - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_prev_shadow_core_results_t),
                "::",
                stringify!(prev_shadow_result_core__spare_0)
            )
        );
    }
    test_field_prev_shadow_result_core__spare_0();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct VL53LX_patch_debug_t {
    result__debug_status: u8,
    result__debug_stage: u8,
}
#[test]
fn bindgen_test_layout_VL53LX_patch_debug_t() {
    assert_eq!(
        ::std::mem::size_of::<VL53LX_patch_debug_t>(),
        2usize,
        concat!("Size of: ", stringify!(VL53LX_patch_debug_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VL53LX_patch_debug_t>(),
        1usize,
        concat!("Alignment of ", stringify!(VL53LX_patch_debug_t))
    );
    fn test_field_result__debug_status() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_debug_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__debug_status) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_debug_t),
                "::",
                stringify!(result__debug_status)
            )
        );
    }
    test_field_result__debug_status();
    fn test_field_result__debug_stage() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_debug_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).result__debug_stage) as usize - ptr as usize
            },
            1usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_debug_t),
                "::",
                stringify!(result__debug_stage)
            )
        );
    }
    test_field_result__debug_stage();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct VL53LX_gph_general_config_t {
    gph__system__thresh_rate_high: u16,
    gph__system__thresh_rate_low: u16,
    gph__system__interrupt_config_gpio: u8,
}
#[test]
fn bindgen_test_layout_VL53LX_gph_general_config_t() {
    assert_eq!(
        ::std::mem::size_of::<VL53LX_gph_general_config_t>(),
        6usize,
        concat!("Size of: ", stringify!(VL53LX_gph_general_config_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VL53LX_gph_general_config_t>(),
        2usize,
        concat!("Alignment of ", stringify!(VL53LX_gph_general_config_t))
    );
    fn test_field_gph__system__thresh_rate_high() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_gph_general_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__system__thresh_rate_high) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_gph_general_config_t),
                "::",
                stringify!(gph__system__thresh_rate_high)
            )
        );
    }
    test_field_gph__system__thresh_rate_high();
    fn test_field_gph__system__thresh_rate_low() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_gph_general_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__system__thresh_rate_low) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_gph_general_config_t),
                "::",
                stringify!(gph__system__thresh_rate_low)
            )
        );
    }
    test_field_gph__system__thresh_rate_low();
    fn test_field_gph__system__interrupt_config_gpio() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_gph_general_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__system__interrupt_config_gpio) as usize
                    - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_gph_general_config_t),
                "::",
                stringify!(gph__system__interrupt_config_gpio)
            )
        );
    }
    test_field_gph__system__interrupt_config_gpio();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct VL53LX_gph_static_config_t {
    gph__dss_config__roi_mode_control: u8,
    gph__dss_config__manual_effective_spads_select: u16,
    gph__dss_config__manual_block_select: u8,
    gph__dss_config__max_spads_limit: u8,
    gph__dss_config__min_spads_limit: u8,
}
#[test]
fn bindgen_test_layout_VL53LX_gph_static_config_t() {
    assert_eq!(
        ::std::mem::size_of::<VL53LX_gph_static_config_t>(),
        8usize,
        concat!("Size of: ", stringify!(VL53LX_gph_static_config_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VL53LX_gph_static_config_t>(),
        2usize,
        concat!("Alignment of ", stringify!(VL53LX_gph_static_config_t))
    );
    fn test_field_gph__dss_config__roi_mode_control() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_gph_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__dss_config__roi_mode_control) as usize
                    - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_gph_static_config_t),
                "::",
                stringify!(gph__dss_config__roi_mode_control)
            )
        );
    }
    test_field_gph__dss_config__roi_mode_control();
    fn test_field_gph__dss_config__manual_effective_spads_select() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_gph_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__dss_config__manual_effective_spads_select) as usize
                    - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_gph_static_config_t),
                "::",
                stringify!(gph__dss_config__manual_effective_spads_select)
            )
        );
    }
    test_field_gph__dss_config__manual_effective_spads_select();
    fn test_field_gph__dss_config__manual_block_select() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_gph_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__dss_config__manual_block_select) as usize
                    - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_gph_static_config_t),
                "::",
                stringify!(gph__dss_config__manual_block_select)
            )
        );
    }
    test_field_gph__dss_config__manual_block_select();
    fn test_field_gph__dss_config__max_spads_limit() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_gph_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__dss_config__max_spads_limit) as usize
                    - ptr as usize
            },
            5usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_gph_static_config_t),
                "::",
                stringify!(gph__dss_config__max_spads_limit)
            )
        );
    }
    test_field_gph__dss_config__max_spads_limit();
    fn test_field_gph__dss_config__min_spads_limit() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_gph_static_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__dss_config__min_spads_limit) as usize
                    - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_gph_static_config_t),
                "::",
                stringify!(gph__dss_config__min_spads_limit)
            )
        );
    }
    test_field_gph__dss_config__min_spads_limit();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct VL53LX_gph_timing_config_t {
    gph__mm_config__timeout_macrop_a_hi: u8,
    gph__mm_config__timeout_macrop_a_lo: u8,
    gph__mm_config__timeout_macrop_b_hi: u8,
    gph__mm_config__timeout_macrop_b_lo: u8,
    gph__range_config__timeout_macrop_a_hi: u8,
    gph__range_config__timeout_macrop_a_lo: u8,
    gph__range_config__vcsel_period_a: u8,
    gph__range_config__vcsel_period_b: u8,
    gph__range_config__timeout_macrop_b_hi: u8,
    gph__range_config__timeout_macrop_b_lo: u8,
    gph__range_config__sigma_thresh: u16,
    gph__range_config__min_count_rate_rtn_limit_mcps: u16,
    gph__range_config__valid_phase_low: u8,
    gph__range_config__valid_phase_high: u8,
}
#[test]
fn bindgen_test_layout_VL53LX_gph_timing_config_t() {
    assert_eq!(
        ::std::mem::size_of::<VL53LX_gph_timing_config_t>(),
        16usize,
        concat!("Size of: ", stringify!(VL53LX_gph_timing_config_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VL53LX_gph_timing_config_t>(),
        2usize,
        concat!("Alignment of ", stringify!(VL53LX_gph_timing_config_t))
    );
    fn test_field_gph__mm_config__timeout_macrop_a_hi() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_gph_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__mm_config__timeout_macrop_a_hi) as usize
                    - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_gph_timing_config_t),
                "::",
                stringify!(gph__mm_config__timeout_macrop_a_hi)
            )
        );
    }
    test_field_gph__mm_config__timeout_macrop_a_hi();
    fn test_field_gph__mm_config__timeout_macrop_a_lo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_gph_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__mm_config__timeout_macrop_a_lo) as usize
                    - ptr as usize
            },
            1usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_gph_timing_config_t),
                "::",
                stringify!(gph__mm_config__timeout_macrop_a_lo)
            )
        );
    }
    test_field_gph__mm_config__timeout_macrop_a_lo();
    fn test_field_gph__mm_config__timeout_macrop_b_hi() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_gph_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__mm_config__timeout_macrop_b_hi) as usize
                    - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_gph_timing_config_t),
                "::",
                stringify!(gph__mm_config__timeout_macrop_b_hi)
            )
        );
    }
    test_field_gph__mm_config__timeout_macrop_b_hi();
    fn test_field_gph__mm_config__timeout_macrop_b_lo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_gph_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__mm_config__timeout_macrop_b_lo) as usize
                    - ptr as usize
            },
            3usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_gph_timing_config_t),
                "::",
                stringify!(gph__mm_config__timeout_macrop_b_lo)
            )
        );
    }
    test_field_gph__mm_config__timeout_macrop_b_lo();
    fn test_field_gph__range_config__timeout_macrop_a_hi() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_gph_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__range_config__timeout_macrop_a_hi) as usize
                    - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_gph_timing_config_t),
                "::",
                stringify!(gph__range_config__timeout_macrop_a_hi)
            )
        );
    }
    test_field_gph__range_config__timeout_macrop_a_hi();
    fn test_field_gph__range_config__timeout_macrop_a_lo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_gph_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__range_config__timeout_macrop_a_lo) as usize
                    - ptr as usize
            },
            5usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_gph_timing_config_t),
                "::",
                stringify!(gph__range_config__timeout_macrop_a_lo)
            )
        );
    }
    test_field_gph__range_config__timeout_macrop_a_lo();
    fn test_field_gph__range_config__vcsel_period_a() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_gph_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__range_config__vcsel_period_a) as usize
                    - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_gph_timing_config_t),
                "::",
                stringify!(gph__range_config__vcsel_period_a)
            )
        );
    }
    test_field_gph__range_config__vcsel_period_a();
    fn test_field_gph__range_config__vcsel_period_b() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_gph_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__range_config__vcsel_period_b) as usize
                    - ptr as usize
            },
            7usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_gph_timing_config_t),
                "::",
                stringify!(gph__range_config__vcsel_period_b)
            )
        );
    }
    test_field_gph__range_config__vcsel_period_b();
    fn test_field_gph__range_config__timeout_macrop_b_hi() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_gph_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__range_config__timeout_macrop_b_hi) as usize
                    - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_gph_timing_config_t),
                "::",
                stringify!(gph__range_config__timeout_macrop_b_hi)
            )
        );
    }
    test_field_gph__range_config__timeout_macrop_b_hi();
    fn test_field_gph__range_config__timeout_macrop_b_lo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_gph_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__range_config__timeout_macrop_b_lo) as usize
                    - ptr as usize
            },
            9usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_gph_timing_config_t),
                "::",
                stringify!(gph__range_config__timeout_macrop_b_lo)
            )
        );
    }
    test_field_gph__range_config__timeout_macrop_b_lo();
    fn test_field_gph__range_config__sigma_thresh() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_gph_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__range_config__sigma_thresh) as usize - ptr as usize
            },
            10usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_gph_timing_config_t),
                "::",
                stringify!(gph__range_config__sigma_thresh)
            )
        );
    }
    test_field_gph__range_config__sigma_thresh();
    fn test_field_gph__range_config__min_count_rate_rtn_limit_mcps() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_gph_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__range_config__min_count_rate_rtn_limit_mcps)
                    as usize
                    - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_gph_timing_config_t),
                "::",
                stringify!(gph__range_config__min_count_rate_rtn_limit_mcps)
            )
        );
    }
    test_field_gph__range_config__min_count_rate_rtn_limit_mcps();
    fn test_field_gph__range_config__valid_phase_low() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_gph_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__range_config__valid_phase_low) as usize
                    - ptr as usize
            },
            14usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_gph_timing_config_t),
                "::",
                stringify!(gph__range_config__valid_phase_low)
            )
        );
    }
    test_field_gph__range_config__valid_phase_low();
    fn test_field_gph__range_config__valid_phase_high() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_gph_timing_config_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gph__range_config__valid_phase_high) as usize
                    - ptr as usize
            },
            15usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_gph_timing_config_t),
                "::",
                stringify!(gph__range_config__valid_phase_high)
            )
        );
    }
    test_field_gph__range_config__valid_phase_high();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct VL53LX_fw_internal_t {
    firmware__internal_stream_count_div: u8,
    firmware__internal_stream_counter_val: u8,
}
#[test]
fn bindgen_test_layout_VL53LX_fw_internal_t() {
    assert_eq!(
        ::std::mem::size_of::<VL53LX_fw_internal_t>(),
        2usize,
        concat!("Size of: ", stringify!(VL53LX_fw_internal_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VL53LX_fw_internal_t>(),
        1usize,
        concat!("Alignment of ", stringify!(VL53LX_fw_internal_t))
    );
    fn test_field_firmware__internal_stream_count_div() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_fw_internal_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).firmware__internal_stream_count_div) as usize
                    - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_fw_internal_t),
                "::",
                stringify!(firmware__internal_stream_count_div)
            )
        );
    }
    test_field_firmware__internal_stream_count_div();
    fn test_field_firmware__internal_stream_counter_val() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_fw_internal_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).firmware__internal_stream_counter_val) as usize
                    - ptr as usize
            },
            1usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_fw_internal_t),
                "::",
                stringify!(firmware__internal_stream_counter_val)
            )
        );
    }
    test_field_firmware__internal_stream_counter_val();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct VL53LX_patch_results_t {
    dss_calc__roi_ctrl: u8,
    dss_calc__spare_1: u8,
    dss_calc__spare_2: u8,
    dss_calc__spare_3: u8,
    dss_calc__spare_4: u8,
    dss_calc__spare_5: u8,
    dss_calc__spare_6: u8,
    dss_calc__spare_7: u8,
    dss_calc__user_roi_spad_en_0: u8,
    dss_calc__user_roi_spad_en_1: u8,
    dss_calc__user_roi_spad_en_2: u8,
    dss_calc__user_roi_spad_en_3: u8,
    dss_calc__user_roi_spad_en_4: u8,
    dss_calc__user_roi_spad_en_5: u8,
    dss_calc__user_roi_spad_en_6: u8,
    dss_calc__user_roi_spad_en_7: u8,
    dss_calc__user_roi_spad_en_8: u8,
    dss_calc__user_roi_spad_en_9: u8,
    dss_calc__user_roi_spad_en_10: u8,
    dss_calc__user_roi_spad_en_11: u8,
    dss_calc__user_roi_spad_en_12: u8,
    dss_calc__user_roi_spad_en_13: u8,
    dss_calc__user_roi_spad_en_14: u8,
    dss_calc__user_roi_spad_en_15: u8,
    dss_calc__user_roi_spad_en_16: u8,
    dss_calc__user_roi_spad_en_17: u8,
    dss_calc__user_roi_spad_en_18: u8,
    dss_calc__user_roi_spad_en_19: u8,
    dss_calc__user_roi_spad_en_20: u8,
    dss_calc__user_roi_spad_en_21: u8,
    dss_calc__user_roi_spad_en_22: u8,
    dss_calc__user_roi_spad_en_23: u8,
    dss_calc__user_roi_spad_en_24: u8,
    dss_calc__user_roi_spad_en_25: u8,
    dss_calc__user_roi_spad_en_26: u8,
    dss_calc__user_roi_spad_en_27: u8,
    dss_calc__user_roi_spad_en_28: u8,
    dss_calc__user_roi_spad_en_29: u8,
    dss_calc__user_roi_spad_en_30: u8,
    dss_calc__user_roi_spad_en_31: u8,
    dss_calc__user_roi_0: u8,
    dss_calc__user_roi_1: u8,
    dss_calc__mode_roi_0: u8,
    dss_calc__mode_roi_1: u8,
    sigma_estimator_calc__spare_0: u8,
    vhv_result__peak_signal_rate_mcps: u16,
    vhv_result__signal_total_events_ref: u32,
    phasecal_result__phase_output_ref: u16,
    dss_result__total_rate_per_spad: u16,
    dss_result__enabled_blocks: u8,
    dss_result__num_requested_spads: u16,
    mm_result__inner_intersection_rate: u16,
    mm_result__outer_complement_rate: u16,
    mm_result__total_offset: u16,
    xtalk_calc__xtalk_for_enabled_spads: u32,
    xtalk_result__avg_xtalk_user_roi_kcps: u32,
    xtalk_result__avg_xtalk_mm_inner_roi_kcps: u32,
    xtalk_result__avg_xtalk_mm_outer_roi_kcps: u32,
    range_result__accum_phase: u32,
    range_result__offset_corrected_range: u16,
}
#[test]
fn bindgen_test_layout_VL53LX_patch_results_t() {
    assert_eq!(
        ::std::mem::size_of::<VL53LX_patch_results_t>(),
        92usize,
        concat!("Size of: ", stringify!(VL53LX_patch_results_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VL53LX_patch_results_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VL53LX_patch_results_t))
    );
    fn test_field_dss_calc__roi_ctrl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__roi_ctrl) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__roi_ctrl)
            )
        );
    }
    test_field_dss_calc__roi_ctrl();
    fn test_field_dss_calc__spare_1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__spare_1) as usize - ptr as usize
            },
            1usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__spare_1)
            )
        );
    }
    test_field_dss_calc__spare_1();
    fn test_field_dss_calc__spare_2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__spare_2) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__spare_2)
            )
        );
    }
    test_field_dss_calc__spare_2();
    fn test_field_dss_calc__spare_3() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__spare_3) as usize - ptr as usize
            },
            3usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__spare_3)
            )
        );
    }
    test_field_dss_calc__spare_3();
    fn test_field_dss_calc__spare_4() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__spare_4) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__spare_4)
            )
        );
    }
    test_field_dss_calc__spare_4();
    fn test_field_dss_calc__spare_5() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__spare_5) as usize - ptr as usize
            },
            5usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__spare_5)
            )
        );
    }
    test_field_dss_calc__spare_5();
    fn test_field_dss_calc__spare_6() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__spare_6) as usize - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__spare_6)
            )
        );
    }
    test_field_dss_calc__spare_6();
    fn test_field_dss_calc__spare_7() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__spare_7) as usize - ptr as usize
            },
            7usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__spare_7)
            )
        );
    }
    test_field_dss_calc__spare_7();
    fn test_field_dss_calc__user_roi_spad_en_0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_0) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_0)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_0();
    fn test_field_dss_calc__user_roi_spad_en_1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_1) as usize - ptr as usize
            },
            9usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_1)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_1();
    fn test_field_dss_calc__user_roi_spad_en_2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_2) as usize - ptr as usize
            },
            10usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_2)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_2();
    fn test_field_dss_calc__user_roi_spad_en_3() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_3) as usize - ptr as usize
            },
            11usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_3)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_3();
    fn test_field_dss_calc__user_roi_spad_en_4() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_4) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_4)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_4();
    fn test_field_dss_calc__user_roi_spad_en_5() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_5) as usize - ptr as usize
            },
            13usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_5)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_5();
    fn test_field_dss_calc__user_roi_spad_en_6() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_6) as usize - ptr as usize
            },
            14usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_6)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_6();
    fn test_field_dss_calc__user_roi_spad_en_7() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_7) as usize - ptr as usize
            },
            15usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_7)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_7();
    fn test_field_dss_calc__user_roi_spad_en_8() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_8) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_8)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_8();
    fn test_field_dss_calc__user_roi_spad_en_9() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_9) as usize - ptr as usize
            },
            17usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_9)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_9();
    fn test_field_dss_calc__user_roi_spad_en_10() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_10) as usize - ptr as usize
            },
            18usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_10)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_10();
    fn test_field_dss_calc__user_roi_spad_en_11() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_11) as usize - ptr as usize
            },
            19usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_11)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_11();
    fn test_field_dss_calc__user_roi_spad_en_12() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_12) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_12)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_12();
    fn test_field_dss_calc__user_roi_spad_en_13() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_13) as usize - ptr as usize
            },
            21usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_13)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_13();
    fn test_field_dss_calc__user_roi_spad_en_14() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_14) as usize - ptr as usize
            },
            22usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_14)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_14();
    fn test_field_dss_calc__user_roi_spad_en_15() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_15) as usize - ptr as usize
            },
            23usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_15)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_15();
    fn test_field_dss_calc__user_roi_spad_en_16() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_16) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_16)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_16();
    fn test_field_dss_calc__user_roi_spad_en_17() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_17) as usize - ptr as usize
            },
            25usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_17)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_17();
    fn test_field_dss_calc__user_roi_spad_en_18() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_18) as usize - ptr as usize
            },
            26usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_18)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_18();
    fn test_field_dss_calc__user_roi_spad_en_19() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_19) as usize - ptr as usize
            },
            27usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_19)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_19();
    fn test_field_dss_calc__user_roi_spad_en_20() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_20) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_20)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_20();
    fn test_field_dss_calc__user_roi_spad_en_21() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_21) as usize - ptr as usize
            },
            29usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_21)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_21();
    fn test_field_dss_calc__user_roi_spad_en_22() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_22) as usize - ptr as usize
            },
            30usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_22)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_22();
    fn test_field_dss_calc__user_roi_spad_en_23() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_23) as usize - ptr as usize
            },
            31usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_23)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_23();
    fn test_field_dss_calc__user_roi_spad_en_24() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_24) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_24)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_24();
    fn test_field_dss_calc__user_roi_spad_en_25() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_25) as usize - ptr as usize
            },
            33usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_25)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_25();
    fn test_field_dss_calc__user_roi_spad_en_26() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_26) as usize - ptr as usize
            },
            34usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_26)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_26();
    fn test_field_dss_calc__user_roi_spad_en_27() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_27) as usize - ptr as usize
            },
            35usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_27)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_27();
    fn test_field_dss_calc__user_roi_spad_en_28() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_28) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_28)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_28();
    fn test_field_dss_calc__user_roi_spad_en_29() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_29) as usize - ptr as usize
            },
            37usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_29)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_29();
    fn test_field_dss_calc__user_roi_spad_en_30() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_30) as usize - ptr as usize
            },
            38usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_30)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_30();
    fn test_field_dss_calc__user_roi_spad_en_31() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_spad_en_31) as usize - ptr as usize
            },
            39usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_spad_en_31)
            )
        );
    }
    test_field_dss_calc__user_roi_spad_en_31();
    fn test_field_dss_calc__user_roi_0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_0) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_0)
            )
        );
    }
    test_field_dss_calc__user_roi_0();
    fn test_field_dss_calc__user_roi_1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__user_roi_1) as usize - ptr as usize
            },
            41usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__user_roi_1)
            )
        );
    }
    test_field_dss_calc__user_roi_1();
    fn test_field_dss_calc__mode_roi_0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__mode_roi_0) as usize - ptr as usize
            },
            42usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__mode_roi_0)
            )
        );
    }
    test_field_dss_calc__mode_roi_0();
    fn test_field_dss_calc__mode_roi_1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_calc__mode_roi_1) as usize - ptr as usize
            },
            43usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_calc__mode_roi_1)
            )
        );
    }
    test_field_dss_calc__mode_roi_1();
    fn test_field_sigma_estimator_calc__spare_0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sigma_estimator_calc__spare_0) as usize - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(sigma_estimator_calc__spare_0)
            )
        );
    }
    test_field_sigma_estimator_calc__spare_0();
    fn test_field_vhv_result__peak_signal_rate_mcps() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vhv_result__peak_signal_rate_mcps) as usize
                    - ptr as usize
            },
            46usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(vhv_result__peak_signal_rate_mcps)
            )
        );
    }
    test_field_vhv_result__peak_signal_rate_mcps();
    fn test_field_vhv_result__signal_total_events_ref() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vhv_result__signal_total_events_ref) as usize
                    - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(vhv_result__signal_total_events_ref)
            )
        );
    }
    test_field_vhv_result__signal_total_events_ref();
    fn test_field_phasecal_result__phase_output_ref() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).phasecal_result__phase_output_ref) as usize
                    - ptr as usize
            },
            52usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(phasecal_result__phase_output_ref)
            )
        );
    }
    test_field_phasecal_result__phase_output_ref();
    fn test_field_dss_result__total_rate_per_spad() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_result__total_rate_per_spad) as usize - ptr as usize
            },
            54usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_result__total_rate_per_spad)
            )
        );
    }
    test_field_dss_result__total_rate_per_spad();
    fn test_field_dss_result__enabled_blocks() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_result__enabled_blocks) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_result__enabled_blocks)
            )
        );
    }
    test_field_dss_result__enabled_blocks();
    fn test_field_dss_result__num_requested_spads() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dss_result__num_requested_spads) as usize - ptr as usize
            },
            58usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(dss_result__num_requested_spads)
            )
        );
    }
    test_field_dss_result__num_requested_spads();
    fn test_field_mm_result__inner_intersection_rate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mm_result__inner_intersection_rate) as usize
                    - ptr as usize
            },
            60usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(mm_result__inner_intersection_rate)
            )
        );
    }
    test_field_mm_result__inner_intersection_rate();
    fn test_field_mm_result__outer_complement_rate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mm_result__outer_complement_rate) as usize
                    - ptr as usize
            },
            62usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(mm_result__outer_complement_rate)
            )
        );
    }
    test_field_mm_result__outer_complement_rate();
    fn test_field_mm_result__total_offset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mm_result__total_offset) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(mm_result__total_offset)
            )
        );
    }
    test_field_mm_result__total_offset();
    fn test_field_xtalk_calc__xtalk_for_enabled_spads() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).xtalk_calc__xtalk_for_enabled_spads) as usize
                    - ptr as usize
            },
            68usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(xtalk_calc__xtalk_for_enabled_spads)
            )
        );
    }
    test_field_xtalk_calc__xtalk_for_enabled_spads();
    fn test_field_xtalk_result__avg_xtalk_user_roi_kcps() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).xtalk_result__avg_xtalk_user_roi_kcps) as usize
                    - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(xtalk_result__avg_xtalk_user_roi_kcps)
            )
        );
    }
    test_field_xtalk_result__avg_xtalk_user_roi_kcps();
    fn test_field_xtalk_result__avg_xtalk_mm_inner_roi_kcps() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).xtalk_result__avg_xtalk_mm_inner_roi_kcps) as usize
                    - ptr as usize
            },
            76usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(xtalk_result__avg_xtalk_mm_inner_roi_kcps)
            )
        );
    }
    test_field_xtalk_result__avg_xtalk_mm_inner_roi_kcps();
    fn test_field_xtalk_result__avg_xtalk_mm_outer_roi_kcps() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).xtalk_result__avg_xtalk_mm_outer_roi_kcps) as usize
                    - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(xtalk_result__avg_xtalk_mm_outer_roi_kcps)
            )
        );
    }
    test_field_xtalk_result__avg_xtalk_mm_outer_roi_kcps();
    fn test_field_range_result__accum_phase() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).range_result__accum_phase) as usize - ptr as usize
            },
            84usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(range_result__accum_phase)
            )
        );
    }
    test_field_range_result__accum_phase();
    fn test_field_range_result__offset_corrected_range() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_patch_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).range_result__offset_corrected_range) as usize
                    - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_patch_results_t),
                "::",
                stringify!(range_result__offset_corrected_range)
            )
        );
    }
    test_field_range_result__offset_corrected_range();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct VL53LX_shadow_system_results_t {
    shadow_phasecal_result__vcsel_start: u8,
    shadow_result__interrupt_status: u8,
    shadow_result__range_status: u8,
    shadow_result__report_status: u8,
    shadow_result__stream_count: u8,
    shadow_result__dss_actual_effective_spads_sd0: u16,
    shadow_result__peak_signal_count_rate_mcps_sd0: u16,
    shadow_result__ambient_count_rate_mcps_sd0: u16,
    shadow_result__sigma_sd0: u16,
    shadow_result__phase_sd0: u16,
    shadow_result__final_crosstalk_corrected_range_mm_sd0: u16,
    shr__peak_signal_count_rate_crosstalk_corrected_mcps_sd0: u16,
    shadow_result__mm_inner_actual_effective_spads_sd0: u16,
    shadow_result__mm_outer_actual_effective_spads_sd0: u16,
    shadow_result__avg_signal_count_rate_mcps_sd0: u16,
    shadow_result__dss_actual_effective_spads_sd1: u16,
    shadow_result__peak_signal_count_rate_mcps_sd1: u16,
    shadow_result__ambient_count_rate_mcps_sd1: u16,
    shadow_result__sigma_sd1: u16,
    shadow_result__phase_sd1: u16,
    shadow_result__final_crosstalk_corrected_range_mm_sd1: u16,
    shadow_result__spare_0_sd1: u16,
    shadow_result__spare_1_sd1: u16,
    shadow_result__spare_2_sd1: u16,
    shadow_result__spare_3_sd1: u8,
    shadow_result__thresh_info: u8,
    shadow_phasecal_result__reference_phase_hi: u8,
    shadow_phasecal_result__reference_phase_lo: u8,
}
#[test]
fn bindgen_test_layout_VL53LX_shadow_system_results_t() {
    assert_eq!(
        ::std::mem::size_of::<VL53LX_shadow_system_results_t>(),
        48usize,
        concat!("Size of: ", stringify!(VL53LX_shadow_system_results_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VL53LX_shadow_system_results_t>(),
        2usize,
        concat!("Alignment of ", stringify!(VL53LX_shadow_system_results_t))
    );
    fn test_field_shadow_phasecal_result__vcsel_start() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_phasecal_result__vcsel_start) as usize
                    - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_phasecal_result__vcsel_start)
            )
        );
    }
    test_field_shadow_phasecal_result__vcsel_start();
    fn test_field_shadow_result__interrupt_status() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result__interrupt_status) as usize - ptr as usize
            },
            1usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_result__interrupt_status)
            )
        );
    }
    test_field_shadow_result__interrupt_status();
    fn test_field_shadow_result__range_status() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result__range_status) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_result__range_status)
            )
        );
    }
    test_field_shadow_result__range_status();
    fn test_field_shadow_result__report_status() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result__report_status) as usize - ptr as usize
            },
            3usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_result__report_status)
            )
        );
    }
    test_field_shadow_result__report_status();
    fn test_field_shadow_result__stream_count() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result__stream_count) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_result__stream_count)
            )
        );
    }
    test_field_shadow_result__stream_count();
    fn test_field_shadow_result__dss_actual_effective_spads_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result__dss_actual_effective_spads_sd0) as usize
                    - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_result__dss_actual_effective_spads_sd0)
            )
        );
    }
    test_field_shadow_result__dss_actual_effective_spads_sd0();
    fn test_field_shadow_result__peak_signal_count_rate_mcps_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result__peak_signal_count_rate_mcps_sd0) as usize
                    - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_result__peak_signal_count_rate_mcps_sd0)
            )
        );
    }
    test_field_shadow_result__peak_signal_count_rate_mcps_sd0();
    fn test_field_shadow_result__ambient_count_rate_mcps_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result__ambient_count_rate_mcps_sd0) as usize
                    - ptr as usize
            },
            10usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_result__ambient_count_rate_mcps_sd0)
            )
        );
    }
    test_field_shadow_result__ambient_count_rate_mcps_sd0();
    fn test_field_shadow_result__sigma_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result__sigma_sd0) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_result__sigma_sd0)
            )
        );
    }
    test_field_shadow_result__sigma_sd0();
    fn test_field_shadow_result__phase_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result__phase_sd0) as usize - ptr as usize
            },
            14usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_result__phase_sd0)
            )
        );
    }
    test_field_shadow_result__phase_sd0();
    fn test_field_shadow_result__final_crosstalk_corrected_range_mm_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result__final_crosstalk_corrected_range_mm_sd0)
                    as usize
                    - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_result__final_crosstalk_corrected_range_mm_sd0)
            )
        );
    }
    test_field_shadow_result__final_crosstalk_corrected_range_mm_sd0();
    fn test_field_shr__peak_signal_count_rate_crosstalk_corrected_mcps_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!(
                    (*ptr).shr__peak_signal_count_rate_crosstalk_corrected_mcps_sd0
                ) as usize
                    - ptr as usize
            },
            18usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shr__peak_signal_count_rate_crosstalk_corrected_mcps_sd0)
            )
        );
    }
    test_field_shr__peak_signal_count_rate_crosstalk_corrected_mcps_sd0();
    fn test_field_shadow_result__mm_inner_actual_effective_spads_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result__mm_inner_actual_effective_spads_sd0)
                    as usize
                    - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_result__mm_inner_actual_effective_spads_sd0)
            )
        );
    }
    test_field_shadow_result__mm_inner_actual_effective_spads_sd0();
    fn test_field_shadow_result__mm_outer_actual_effective_spads_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result__mm_outer_actual_effective_spads_sd0)
                    as usize
                    - ptr as usize
            },
            22usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_result__mm_outer_actual_effective_spads_sd0)
            )
        );
    }
    test_field_shadow_result__mm_outer_actual_effective_spads_sd0();
    fn test_field_shadow_result__avg_signal_count_rate_mcps_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result__avg_signal_count_rate_mcps_sd0) as usize
                    - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_result__avg_signal_count_rate_mcps_sd0)
            )
        );
    }
    test_field_shadow_result__avg_signal_count_rate_mcps_sd0();
    fn test_field_shadow_result__dss_actual_effective_spads_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result__dss_actual_effective_spads_sd1) as usize
                    - ptr as usize
            },
            26usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_result__dss_actual_effective_spads_sd1)
            )
        );
    }
    test_field_shadow_result__dss_actual_effective_spads_sd1();
    fn test_field_shadow_result__peak_signal_count_rate_mcps_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result__peak_signal_count_rate_mcps_sd1) as usize
                    - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_result__peak_signal_count_rate_mcps_sd1)
            )
        );
    }
    test_field_shadow_result__peak_signal_count_rate_mcps_sd1();
    fn test_field_shadow_result__ambient_count_rate_mcps_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result__ambient_count_rate_mcps_sd1) as usize
                    - ptr as usize
            },
            30usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_result__ambient_count_rate_mcps_sd1)
            )
        );
    }
    test_field_shadow_result__ambient_count_rate_mcps_sd1();
    fn test_field_shadow_result__sigma_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result__sigma_sd1) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_result__sigma_sd1)
            )
        );
    }
    test_field_shadow_result__sigma_sd1();
    fn test_field_shadow_result__phase_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result__phase_sd1) as usize - ptr as usize
            },
            34usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_result__phase_sd1)
            )
        );
    }
    test_field_shadow_result__phase_sd1();
    fn test_field_shadow_result__final_crosstalk_corrected_range_mm_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result__final_crosstalk_corrected_range_mm_sd1)
                    as usize
                    - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_result__final_crosstalk_corrected_range_mm_sd1)
            )
        );
    }
    test_field_shadow_result__final_crosstalk_corrected_range_mm_sd1();
    fn test_field_shadow_result__spare_0_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result__spare_0_sd1) as usize - ptr as usize
            },
            38usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_result__spare_0_sd1)
            )
        );
    }
    test_field_shadow_result__spare_0_sd1();
    fn test_field_shadow_result__spare_1_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result__spare_1_sd1) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_result__spare_1_sd1)
            )
        );
    }
    test_field_shadow_result__spare_1_sd1();
    fn test_field_shadow_result__spare_2_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result__spare_2_sd1) as usize - ptr as usize
            },
            42usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_result__spare_2_sd1)
            )
        );
    }
    test_field_shadow_result__spare_2_sd1();
    fn test_field_shadow_result__spare_3_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result__spare_3_sd1) as usize - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_result__spare_3_sd1)
            )
        );
    }
    test_field_shadow_result__spare_3_sd1();
    fn test_field_shadow_result__thresh_info() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result__thresh_info) as usize - ptr as usize
            },
            45usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_result__thresh_info)
            )
        );
    }
    test_field_shadow_result__thresh_info();
    fn test_field_shadow_phasecal_result__reference_phase_hi() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_phasecal_result__reference_phase_hi) as usize
                    - ptr as usize
            },
            46usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_phasecal_result__reference_phase_hi)
            )
        );
    }
    test_field_shadow_phasecal_result__reference_phase_hi();
    fn test_field_shadow_phasecal_result__reference_phase_lo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_system_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_phasecal_result__reference_phase_lo) as usize
                    - ptr as usize
            },
            47usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_system_results_t),
                "::",
                stringify!(shadow_phasecal_result__reference_phase_lo)
            )
        );
    }
    test_field_shadow_phasecal_result__reference_phase_lo();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct VL53LX_shadow_core_results_t {
    shadow_result_core__ambient_window_events_sd0: u32,
    shadow_result_core__ranging_total_events_sd0: u32,
    shadow_result_core__signal_total_events_sd0: i32,
    shadow_result_core__total_periods_elapsed_sd0: u32,
    shadow_result_core__ambient_window_events_sd1: u32,
    shadow_result_core__ranging_total_events_sd1: u32,
    shadow_result_core__signal_total_events_sd1: i32,
    shadow_result_core__total_periods_elapsed_sd1: u32,
    shadow_result_core__spare_0: u8,
}
#[test]
fn bindgen_test_layout_VL53LX_shadow_core_results_t() {
    assert_eq!(
        ::std::mem::size_of::<VL53LX_shadow_core_results_t>(),
        36usize,
        concat!("Size of: ", stringify!(VL53LX_shadow_core_results_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VL53LX_shadow_core_results_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VL53LX_shadow_core_results_t))
    );
    fn test_field_shadow_result_core__ambient_window_events_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result_core__ambient_window_events_sd0) as usize
                    - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_core_results_t),
                "::",
                stringify!(shadow_result_core__ambient_window_events_sd0)
            )
        );
    }
    test_field_shadow_result_core__ambient_window_events_sd0();
    fn test_field_shadow_result_core__ranging_total_events_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result_core__ranging_total_events_sd0) as usize
                    - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_core_results_t),
                "::",
                stringify!(shadow_result_core__ranging_total_events_sd0)
            )
        );
    }
    test_field_shadow_result_core__ranging_total_events_sd0();
    fn test_field_shadow_result_core__signal_total_events_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result_core__signal_total_events_sd0) as usize
                    - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_core_results_t),
                "::",
                stringify!(shadow_result_core__signal_total_events_sd0)
            )
        );
    }
    test_field_shadow_result_core__signal_total_events_sd0();
    fn test_field_shadow_result_core__total_periods_elapsed_sd0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result_core__total_periods_elapsed_sd0) as usize
                    - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_core_results_t),
                "::",
                stringify!(shadow_result_core__total_periods_elapsed_sd0)
            )
        );
    }
    test_field_shadow_result_core__total_periods_elapsed_sd0();
    fn test_field_shadow_result_core__ambient_window_events_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result_core__ambient_window_events_sd1) as usize
                    - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_core_results_t),
                "::",
                stringify!(shadow_result_core__ambient_window_events_sd1)
            )
        );
    }
    test_field_shadow_result_core__ambient_window_events_sd1();
    fn test_field_shadow_result_core__ranging_total_events_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result_core__ranging_total_events_sd1) as usize
                    - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_core_results_t),
                "::",
                stringify!(shadow_result_core__ranging_total_events_sd1)
            )
        );
    }
    test_field_shadow_result_core__ranging_total_events_sd1();
    fn test_field_shadow_result_core__signal_total_events_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result_core__signal_total_events_sd1) as usize
                    - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_core_results_t),
                "::",
                stringify!(shadow_result_core__signal_total_events_sd1)
            )
        );
    }
    test_field_shadow_result_core__signal_total_events_sd1();
    fn test_field_shadow_result_core__total_periods_elapsed_sd1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shadow_result_core__total_periods_elapsed_sd1) as usize
                    - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_shadow_core_results_t),
                "::",
                stringify!(shadow_result_core__total_periods_elapsed_sd1)
            )
        );
    }
    test_field_shadow_result_core__total_periods_elapsed_sd1();
    fn test_field_shadow_result_core__spare_0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VL53LX_shadow_core_results_t>::uninit();
                let ptr = uninit.as_ptr();
