use super::*;

#[test]
fn bindgen_test_layout_vl53_lx_hist_gen3_dmax_private_data_t() {
    assert_eq!(
        ::std::mem::size_of::<Vl53lxHistGen3DmaxPrivateData>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(VL53LX_hist_gen3_dmax_private_data_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<Vl53lxHistGen3DmaxPrivateData>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(VL53LX_hist_gen3_dmax_private_data_t)
        )
    );
    fn test_field_vl53lx_p_037() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<Vl53lxHistGen3DmaxPrivateData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vl53lx_p_037) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(vl53lx_p_037)
            )
        );
    }
    test_field_vl53lx_p_037();
    fn test_field_vl53lx_p_063() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<Vl53lxHistGen3DmaxPrivateData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vl53lx_p_063) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(vl53lx_p_063)
            )
        );
    }
    test_field_vl53lx_p_063();
    fn test_field_vl53lx_p_064() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<Vl53lxHistGen3DmaxPrivateData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vl53lx_p_064) as usize - ptr as usize
            },
            5usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(vl53lx_p_064)
            )
        );
    }
    test_field_vl53lx_p_064();
    fn test_field_vl53lx_p_065() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<Vl53lxHistGen3DmaxPrivateData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vl53lx_p_065) as usize - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(vl53lx_p_065)
            )
        );
    }
    test_field_vl53lx_p_065();
    fn test_field_vl53lx_p_066() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<Vl53lxHistGen3DmaxPrivateData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vl53lx_p_066) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(vl53lx_p_066)
            )
        );
    }
    test_field_vl53lx_p_066();
    fn test_field_vl53lx_p_067() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<Vl53lxHistGen3DmaxPrivateData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vl53lx_p_067) as usize - ptr as usize
            },
            10usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(vl53lx_p_067)
            )
        );
    }
    test_field_vl53lx_p_067();
    fn test_field_vl53lx_p_038() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<Vl53lxHistGen3DmaxPrivateData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vl53lx_p_038) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(vl53lx_p_038)
            )
        );
    }
    test_field_vl53lx_p_038();
    fn test_field_vl53lx_p_009() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<Vl53lxHistGen3DmaxPrivateData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vl53lx_p_009) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(vl53lx_p_009)
            )
        );
    }
    test_field_vl53lx_p_009();
    fn test_field_vl53lx_p_033() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<Vl53lxHistGen3DmaxPrivateData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vl53lx_p_033) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(vl53lx_p_033)
            )
        );
    }
    test_field_vl53lx_p_033();
    fn test_field_vl53lx_p_034() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<Vl53lxHistGen3DmaxPrivateData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vl53lx_p_034) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(vl53lx_p_034)
            )
        );
    }
    test_field_vl53lx_p_034();
    fn test_field_vl53lx_p_004() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<Vl53lxHistGen3DmaxPrivateData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vl53lx_p_004) as usize - ptr as usize
            },
            26usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(vl53lx_p_004)
            )
        );
    }
    test_field_vl53lx_p_004();
    fn test_field_vl53lx_p_028() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<Vl53lxHistGen3DmaxPrivateData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vl53lx_p_028) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(vl53lx_p_028)
            )
        );
    }
    test_field_vl53lx_p_028();
    fn test_field_vl53lx_p_035() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<Vl53lxHistGen3DmaxPrivateData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vl53lx_p_035) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(vl53lx_p_035)
            )
        );
    }
    test_field_vl53lx_p_035();
    fn test_field_vl53lx_p_036() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<Vl53lxHistGen3DmaxPrivateData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vl53lx_p_036) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(vl53lx_p_036)
            )
        );
    }
    test_field_vl53lx_p_036();
    fn test_field_vl53lx_p_022() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<Vl53lxHistGen3DmaxPrivateData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vl53lx_p_022) as usize - ptr as usize
            },
            38usize,
            concat!(
                "Offset of field: ",
                stringify!(VL53LX_hist_gen3_dmax_private_data_t),
                "::",
                stringify!(vl53lx_p_022)
            )
        );
    }
    test_field_vl53lx_p_022();
}
